<template>
  <!-- Modal -->
  <TransitionRoot :show="isOpen" as="template" enter="duration-300 ease-out" enter-from="opacity-0" enter-to="opacity-100" leave="duration-200 ease-in" leave-from="opacity-100" leave-to="opacity-0">
    <Dialog :open="isOpen" @close="setIsOpen">
      <div class="fixed inset-0 bg-black/30 backdrop-blur" aria-hidden="true" />
      <div class="fixed inset-0 overflow-y-auto">
        <div class="flex min-h-full items-center justify-center p-4 shadow-2xl">
          <DialogPanel class="w-full max-w-sm md:max-w-md lg:max-w-lg xl:max-w-xl rounded bg-white shadow-2xl">
            <DialogTitle class="flex flex-col justify-end text-white font-bold leading-6 w-full bg-gradient-to-r from-cyan-500 to-blue-500">
              <img class="object-cover object-center h-64" :src="modalData.picture_url" :alt="modalData.name" />
              <h1 class="pt-4 pl-4 text-4xl w-full bg-slate-700 bg-opacity-10">{{ modalData.name ?? "ไม่ได้ระบุ" }}</h1>
            </DialogTitle>
            <DialogDescription class="p-4 space-y-3">
              <h2> 🌿 คำอธิบาย</h2>
              <p>{{ modalData.description ?? "ไม่ได้ระบุ" }}</p>
              <h2> 🥚 ส่วนผสม</h2>
              <ul>
                <li class="cursor-pointer inline-block bg-green-100 hover:bg-green-200 rounded-full px-3 py-1 text-sm font-semibold text-green-700 mr-2 mb-2" v-for="ingredient in modalData.ingredient">{{ ingredient ?? "ไม่ได้ระบุ" }}</li>
              </ul>
              <h2> ✨ วิธีทำ</h2>
              <div class="prose">{{ modalData.step ?? "ไม่ได้ระบุ" }}</div>
              <h2> 🏷 แท็ก</h2>
              <ul class="flex gap-3">
                <li v-for="tag in modalData.tag" class="list-none rounded bg-pink-100 hover:bg-pink-300 text-pink-700 px-2 py-1 cursor-pointer">{{ tag ?? "ไม่ได้ระบุ" }}</li>
              </ul>
              <h2> 🔦 อ้างอิง</h2>
              <ul class="flex gap-3">
                <li class="list-none rounded bg-blue-100 hover:bg-blue-300 text-blue-700 px-2 py-1 cursor-pointer">{{ modalData.source ?? "ไม่ได้ระบุ" }}</li>
              </ul>
            </DialogDescription>
            <div class="flex flex-row-reverse gap-4 px-4 pb-4 pt-4">
              <button @click="setIsOpen(false)" class="py-2 px-4 rounded bg-purple-200 hover:bg-purple-300 text-purple-700">🔎 ไปยังเว็บไซต์ต้นทาง</button>
              <button @click="setIsOpen(false)" class="py-2 px-4 rounded bg-red-200 hover:bg-red-300 text-red-700">🚫 ออก</button>
            </div>
          </DialogPanel>
        </div>
      </div>
    </Dialog>
  </TransitionRoot>

  <!-- Search Bar -->
  <h1 class="my-4 text-center">ค้นหาเมนู</h1>
  <div class="max-w-md mx-auto">
    <div class="relative flex items-center rounded-lg shadow-lg overflow-hidden">
      <div class="grid place-items-center h-full w-12">
        <svg xmlns="http://www.w3.org/2000/svg" class="h-6 w-6" fill="none" viewBox="0 0 24 24" stroke="currentColor">
          <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M21 21l-6-6m2-5a7 7 0 11-14 0 7 7 0 0114 0z"></path>
        </svg>
      </div>
      <input type="text" class="p-4 focus:outline-none peer h-full w-full pr-2 input max-w-md" placeholder="พริก, ต้นหอม, ..." v-model="searchInput" />
    </div>
    <div class="flex items-end justify-center">
      <SwitchLabel class="mr-4">ค้นหาจากวัตถุดิบ</SwitchLabel>
      <Switch @click="isChecked = !isChecked" v-model="isChecked" :class="isChecked ? 'bg-amber-400' : 'bg-gray-200'" class="mt-4 relative inline-flex h-6 w-11 items-center rounded-full">
        <span class="sr-only">Enable notifications</span>
        <span :class="isChecked ? 'translate-x-6' : 'translate-x-1'" class="inline-block h-4 w-4 transform rounded-full bg-white transition" />
      </Switch>
    </div>
  </div>

  <!-- Recomended Menu -->
  <h1 class="my-4">เมนูอาหารแนะนำ</h1>
  <div class="columns-1 sm:columns-2 md:columns-3 lg:columns-4 xl:columns-5 gap-8 space-y-6">
    <div v-for="x in foodSearchResult" :key="x.id" class="max-w-sm rounded overflow-hidden shadow-lg cursor-pointer hover:-translate-y-4 hover:scale-110 duration-100">
      <img class="w-full object-cover h-48" :src="x.picture_url" :alt="x.name" @click="fireModal(x)" />
      <div class="px-6 py-4" @click="fireModal(x)">
        <div class="font-bold text-xl mb-2">{{ x.name ?? "ไม่ได้ระบุ" }}</div>
        <p class="text-gray-700 text-base">
          {{ x.description ?? "ไม่ได้ระบุ" }}
        </p>
      </div>
      <div class="px-6 pt-4 pb-2 cursor-pointer" @click="fireModal(x)">
        <h3 class="text-sm mb-1">แท็ก</h3>
        <span v-for="tag in x.tag" class="inline-block bg-pink-100 hover:bg-pink-200 rounded-full px-3 py-1 text-xs font-semibold text-pink-700 mr-2 mb-2">#{{ tag ?? "ไม่ได้ระบุ" }}</span>
      </div>
      <!-- Action buttons -->
      <div class="flex w-full justify-center p-1">
        <button @click="editAction(x)" class="flex p-1.5 gap-2 items-center hover:bg-gray-100 text-gray-700 text-sm px-2 rounded">
          <!-- <PencilIcon class="w-4 h-4" /> -->
          <span>🖊 แก้ไข</span>
        </button>
        <!-- <button class="flex p-1.5 gap-2 items-center hover:bg-gray-100 text-gray-700 text-sm px-2 rounded">
          <EyeIcon class="w-4 h-4" />
          <span>{{ x.seen ?? "0" }}</span>
        </button> -->
        <button @click="save(x)" class="flex p-1.5 gap-2 items-center hover:bg-gray-100 text-gray-700 text-sm px-2 rounded">
          <!-- <BookmarkIcon class="w-4 h-4" /> -->
          <span>📝 บันทึก</span>
        </button>
        <!-- <button class="flex p-1.5 gap-2 items-center hover:bg-gray-100 text-700 text-sm px-2 rounded">
          <HeartIcon class="w-4 h-4" />
          <span>{{ x.like ?? "0" }}</span>
        </button> -->
      </div>
    </div>
  </div>

  <!-- Popular Ingredient -->
  <h1 class="my-4">วัตถุดิบยอดนิยม</h1>
  <div class="columns-1 sm:columns-2 md:columns-3 lg:columns-4 xl:columns-5 gap-8 space-y-6">
    <div v-for="x in ingredientSearchResult" class="cursor-pointer max-w-sm rounded overflow-hidden shadow-lg mx-auto hover:shadow-xl hover:backdrop-brightness-70 hover:bg-white/90 hover:-translate-y-4 hover:scale-110 duration-100" @click="fireModal(x)">
      <img class="w-full object-cover h-48" :src="x.picture_url" :alt="x.name" />
      <div class="px-6 py-6">
        <div class="font-bold text-xl mb-2">{{ x.name ?? "ไม่ได้ระบุ" }}</div>
        <p class="text-gray-700 text-base">
          {{ x.description ?? "ไม่ได้ระบุ" }}
        </p>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref, onMounted, watch, computed } from "vue";
import router from "../router";
import { userStore } from "../stores/user";
import { supabase } from "../lib/supabase";
import { foodStore } from "../stores/food";
import { storeToRefs } from "pinia";
import { Switch, Dialog, DialogPanel, DialogTitle, DialogDescription, TransitionRoot } from "@headlessui/vue";
import { BookmarkIcon, EyeIcon, HeartIcon, PencilIcon } from "@heroicons/vue/24/outline";
import localForage from "localforage";
import toastr from "toastr";

const user = userStore();
const bookmark = ref([]);
const editAction = (food) => {
  router.push({ name: "edit", params: { id: food.id } });
}
if (localStorage.setItem("name", "Iho")) {
  console.log("localStorage enabled!");
}
// Modal
const isChecked = ref(true); // Checkbox Search Button
const isOpen = ref(false);
function setIsOpen(value) {
  isOpen.value = value;
}

let modalData = ref({});
const fireModal = (food) => {
  modalData.value = {};
  setIsOpen(true);
  modalData.value.id = food.id;
  modalData.value.name = food.name;
  modalData.value.description = food.description;
  modalData.value.ingredient = food.ingredient;
  modalData.value.picture_url = food.picture_url;
  modalData.value.source = food.source;
  modalData.value.step = food.step;
  modalData.value.tag = food.tag;
  console.log(food);
  return modalData;
};

const foods = ref([]);
const ingredients = ref([]);
let searchInput = ref("");
let foodSearchResult = computed(() =>
  foods.value.filter((x) => {
    return x.name.includes(searchInput.value);
  })
);

let ingredientSearchResult = computed(() =>
  ingredients.value.filter((x) => {
    return x.name.includes(searchInput.value);
  })
);
// Log on console every input value
watch(searchInput, () => console.log(foodSearchResult.value));
watch(isChecked, () => console.log(isChecked.value));

const getFoods = async () => {
  const { data } = await supabase.from("foods").select();
  foods.value = data;
  //console.log(foods.value);
};

const getIngredient = async () => {
  const { data } = await supabase.from("ingredients").select();
  ingredients.value = data;
};

const save = (food) => {
  toastr.success('บันทึกสำเร็จ!')
  if (localStorage.getItem("savedFoods") !== null) {
    let savedFoods = localStorage.getItem("savedFoods");
  } else {
    localStorage.setItem("savedFoods", JSON.stringify([food])); // if there is no saved.
  }
};

onMounted(async () => {
  getFoods();
  getIngredient();

  //Save item to localStorage
  //localStorage.setItem('savedFood', JSON.stringify(foodsList));
});

const ingredientsList = ref([
  {
    id: "4",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริก",
    description: "ลักษณะสีแดงเมื่อโตเต็มวัย ทำโดนร่างกายจะรู้สึกแสบ หากโดนปากจะเรียกว่าเผ็ด",
    picture_url: "https://s.isanook.com/he/0/ud/6/34241/chilies.jpg",
  },
  {
    id: "5",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริกชี้ฟ้า",
    description: "พืชผักสมุนไพร ที่เจริญเติบโตได้ง่ายๆ เป็นไม้ทรงพุ่มขนาดเล็ก มีลำต้นกลมๆ มีสีเขียว รับประทานแล้วเผ็ด",
    picture_url: "https://img10.jd.co.th/n0/jfs/t34/359/4282920353/87934/21d03099/5fcf6843N4a47c1eb.jpg!q70.jpg",
  },
  {
    id: "6",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริกขี้หนูสวน",
    description: "เป็นพริกขี้หนูชนิดหนึ่ง เป็นพืชผักสมุนไพร ที่เจริญเติบโตได้ง่ายๆ เป็นไม้ทรงพุ่มขนาดเล็ก",
    picture_url: "https://inwfile.com/s-cr/j6dj0b.jpg",
  },
  {
    id: "7",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "กระเทียม",
    description: "พืชสมุนไพรไทย เป็นเครื่องเทศชนิดหนึ่ง ที่เป็นที่รู้จักกันดี เป็นพืชล้มลุก มีหัวใต้ดิน มีกลิ่นแรง มีกลิ่นฉุนจัด",
    picture_url: "https://www.matichonweekly.com/wp-content/uploads/2020/12/%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%97%E0%B8%B5%E0%B8%A2%E0%B8%A1%E0%B8%99%E0%B8%B3.jpg",
  },
  {
    id: "8",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "หอมแดง",
    description: "เป็นหอมชนิดหนึ่ง หัวมีทรงกลมหรือทรงกลมรี มีเปลือกกาบใบห่อหุ้มหลายๆชั้น หัวแก่มีเปลือกด้านนอกแห้ง มีสีแดงหรือสีแดงอมม่วง มีกลิ่นฉุน รสชาติเผ็ดร้อน",
    picture_url: "https://www.thai-thaifood.com/wp-content/uploads/2017/01/%E0%B8%AB%E0%B8%AD%E0%B8%A1%E0%B9%81%E0%B8%94%E0%B8%87-shallot-678x381.jpg",
  },
  {
    id: "9",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ข่า",
    description: 'พืชที่มีลำต้นอยู่ใต้ดินเรียกว่า "เหง้า" อยู่ในวงศ์ขิง เป็นไม้ล้มลุก เป็นพืชสมุนไพรที่นำมาใช้ในการประกอบอาหาร',
    picture_url: "https://decor.mthai.com/app/uploads/2017/01/800_thumbnail_01_2017_kah_planting.jpg",
  },
  {
    id: "10",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ตะไคร้",
    description: "สมุนไพรไทย ที่เป็นที่รู้จักกันดี เป็นพืชตระกูลหญ้า เป็นที่นิยมปลูกกันทั่วไปๆ",
    picture_url: "https://cdn-cakfh.nitrocdn.com/uCvbbthIGuqozYBVHNiffOSAfPDdhkkl/assets/images/optimized/rev-464aa68/kaset.today/wp-content/uploads/2021/01/c77e15321923b90f4afc496c111da425.%E0%B8%95%E0%B8%B0%E0%B9%84%E0%B8%84%E0%B8%A3%E0%B9%89%E0%B9%81%E0%B8%9E%E0%B8%8703-696x407-1.jpg",
  },
  {
    id: "11",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "รากผักชี",
    description: "เครื่องเทศที่นิยมนำมาหมักเนื้อสัตว์ เพื่อดับกลิ่นคาว และเพิ่มความหอม โดยเฉพาะอาหารที่ปิ้งย่าง",
    picture_url: "https://www.kruamoomoo.com/wp-content/uploads/2020/02/kha-moo-palo-recipe-kruamoomoo-20.jpg",
  },
  {
    id: "12",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "มะกรูด",
    description: "พืชในสกุลส้ม นิยมใช้ใบมะกรูดและผิวมะกรูดเป็นส่วนหนึ่งของเครื่องปรุงอาหารหลายชนิด",
    picture_url: "https://res.cloudinary.com/dk0z4ums3/image/upload/v1524590323/attached_image_th/%E0%B8%A1%E0%B8%B0%E0%B8%81%E0%B8%A3%E0%B8%B9%E0%B8%94-%E0%B8%AA%E0%B8%A1%E0%B8%B8%E0%B8%99%E0%B9%84%E0%B8%9E%E0%B8%A3%E0%B8%81%E0%B8%A5%E0%B8%B4%E0%B9%88%E0%B8%99%E0%B8%AB%E0%B8%AD%E0%B8%A1-%E0%B9%80-pobpad.jpg",
  },
  {
    id: "13",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ขมิ้น",
    description: "พืชสมุนไพร ที่เป็นที่รู้จักกันดี เป็นพืชล้มลุก อยู่ในวงศ์ขิง มีเหง้าอยู่ใต้ดิน เป็นเหง้าสั้นแตกหน่อได้ เนื้อในของเหง้ามีสีเหลืองส้ม",
    picture_url: "https://www.ginnginn.com/wp-content/uploads/2016/08/shutterstock_423000034-1-e1540117286124.jpg",
  },
  {
    id: "14",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริกไทยขาวเม็ด",
    description: "ผลพริกไทยแก่เต็มที่แต่ยังไม่ถึงขั้นสุก โดยพริกไทยเม็ดขาวก็คือพริกไทยดำที่ผ่านการเลาะเปลือกนอกออก",
    picture_url: "https://www.greenery.org/wp-content/uploads/2020/12/How-to_Gravy-2.jpg",
  },
  {
    id: "15",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ลูกผักชี",
    description: "ใช้ผลแก่ตากแห้งจะมีลักษณะเป็นลูกกลมเล็ก ๆ สีน้ำตาลอมเหลืองนำมาป่นเป็นผง มีกลิ่นหอม รสของลูกผักชี จะมีรสซ่าอ่อน ๆ คล้ายชะเอม",
    picture_url: "https://lzd-img-global.slatic.net/g/p/72fb500d0f58301500740c231ea27364.jpg_2200x2200q80.jpg_.webp",
  },
  {
    id: "16",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ยี่หร่า",
    description: "พืชที่จัดอยู่ในวงศ์ผักชี มีถิ่นกำเนิดในแถบทะเลเมดิเตอร์เรเนียนชนิดที่เหมาะกับการนำเมล็ดมาคั่วแล้วบดให้ละเอียด เพื่อใช้เป็นเครื่องเทศ",
    picture_url: "https://lzd-img-global.slatic.net/g/p/de4f8bdbae8f46421e1d76e6313a7471.jpg_2200x2200q80.jpg_.webp",
  },
  {
    id: "17",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เกลือ",
    description: "สารประกอบทางเคมีที่มีชื่อเรียกว่า โซเดียมคลอไรด์ ใช้กันอย่างแพร่หลายในกลุ่มอุตสาหกรรมอาหาร เนื่องจากช่วยประหยัดต้นทุนและเพิ่มความหลากหลายในการปรุงรส",
    picture_url: "https://www.easycookingmenu.com/media/k2/items/cache/97a787f8d6fb66aaef15fa858aa433ea_XL.jpg",
  },
  {
    id: "18",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "กะปิ",
    description: "เครื่องปรุงรสเค็ม มีสีน้ำตาล หรือแดงคล้ำทำด้วยกุ้ง หรือเคย โขลกกับเกลือจนเข้ากันแล้วหมักไว้",
    picture_url: "https://www.khunmaejuphuket.com/wp-content/uploads/2018/07/%E0%B8%81%E0%B8%B0%E0%B8%9B%E0%B8%B4%E0%B8%81%E0%B8%B8%E0%B9%89%E0%B8%87%E0%B8%95%E0%B8%B2%E0%B8%94%E0%B8%B33.jpg",
  },
  {
    id: "19",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เนื้อไก่",
    description: "เนื้อสัตว์ที่มาจากไก่ มีราคาถูกกว่าเนื้อสัตว์ชนิดอื่น ๆ เมื่อเทียบกับเนื้อวัวหรือเนื้อหมู เนื้อไก่ได้รับความนิยมในอาหารทั่วโลก",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Chickens_in_market.jpg/1024px-Chickens_in_market.jpg",
  },
  {
    id: "20",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "หัวกะทิ",
    description: "กะทิเข้มข้นที่คั้นน้ำครั้งแรกมีส่วนผสมของน้ำเล็กน้อยทำให้ได้น้ำกะทิเข้มข้น",
    picture_url: "https://d3h1lg3ksw6i6b.cloudfront.net/media/image/2021/08/13/e4d02e14ef7144cfbff395fa9fb0b6c7_Coconut+Milk%3A+Fresh+or+Boxed%3F+Knowing+Them+Better+For+Successful+Cooking1.jpg",
  },
  {
    id: "21",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "หางกะทิ",
    description: "กะทิที่คั้นน้ำครั้งที่สอง-สามมีส่วนผสมของน้ำมากทำให้ได้น้ำกะทิที่ไม่เข้มข้น",
    picture_url: "https://www.easycookingmenu.com/media/k2/items/cache/7081cca2f9cd0c06f2cce9e93d01dda9_XL.jpg",
  },
  {
    id: "22",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "มะเขือเปราะ",
    description: "พืชล้มลุก ทรงพุ่มขนาดเล็ก ลำต้นตั้งตรง สีเขียว ผิวเรียบ ไม่มียาง มีรากเป็นรากแก้ว ทรงกลม สีน้ำตาล แทงลงดิน",
    picture_url: "https://img.kapook.com/u/2017/Tanapol/health/ma/m6.jpg",
  },
  {
    id: "23",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "มะเขือพวง",
    description: "พืชตระกูลมะเขือ เป็นไม้ข้ามปี มีถิ่นกำเนิดในแถบรัฐฟลอริดา, หมู่เกาะเวสต์ อินดีส์, เม็กซิโก จนถึงอเมริกากลาง",
    picture_url: "http://t2.gstatic.com/licensed-image?q=tbn:ANd9GcQd6bEIvAngOA5UrQ8xaNdgdsetDxH2pladY-_nsmWMmzwx7dHTwznCf1-5e9eyCNeDpt1Y9ecX6n-u8JE",
  },
  {
    id: "24",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ใบมะกรูด",
    description: "พืชในสกุลส้ม นิยมใช้ใบมะกรูดและผิวมะกรูดเป็นส่วนหนึ่งของเครื่องปรุงอาหารหลายชนิด",
    picture_url: "https://www.parichfertilizer.com/wp-content/uploads/%E0%B9%83%E0%B8%9A%E0%B8%A1%E0%B8%B0%E0%B8%81%E0%B8%A3%E0%B8%B9%E0%B8%94-1000x523.png",
  },
  {
    id: "25",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "โหระพา",
    description: "ไม้ล้มลุก สูง 0.5–1 เมตร ลำต้นเป็นสี่เหลี่ยมมีกิ่งสีอ่อนม่วงแดง ใบเป็นใบเดี่ยวออกตรงข้าม รูปไข่หรือรูปรี",
    picture_url: "http://t0.gstatic.com/licensed-image?q=tbn:ANd9GcSBUfAbR3Gp_3Za3l4TctfaWKfvh-E-U2ms5Uw_KdO_LP9q7gOatWB-WXQFtOMIYiSu5JvErUX9LsfpsHE",
  },
  {
    id: "26",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำปลา",
    description: "เครื่องปรุงรสที่ได้จากการหมักปลา กับเกลือให้มีรสเค็มและกลิ่นชวนรับประทาน เป็นส่วนผสมสำคัญของแกงและน้ำจิ้มหลายชนิด",
    picture_url: "https://www.healthcarethai.com/wp-content/uploads/%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%9B%E0%B8%A5%E0%B8%B2.jpg",
  },
  {
    id: "27",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำตาลทรายแดง",
    description: "น้ำตาลทรายที่ไม่ผ่านการฟอกขาวหรือผ่านการฟอกเพียงเล็กน้อย ทำให้มีสีน้ำตาลแดงอันเป็นเพราะมีกากน้ำตาลเหลืออยู่",
    picture_url: "https://www.tapetchgroup.com/wp-content/uploads/2022/05/brownsugar2.jpg",
  },
  {
    id: "28",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เต้าหู้ไข่",
    description: "ผลิตภัณฑ์ที่มีไข่ขาวหรือไข่ขาวผสมไข่แดงเป็นส่วนประกอบหลัก อาจผสมน้ำและเครื่องปรุงรส",
    picture_url: "https://img.my-best.in.th/content_section/choice_component/contents/607a25b4e86784762964d85e45f19526.jpg?ixlib=rails-4.2.0&q=70&lossless=0&w=690&fit=max&s=32bebf1601de68018b559e3184058b09",
  },
  {
    id: "29",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "กุยช่ายขาว",
    description: "พืชชนิดเดียวกับกุยช่ายเขียว แต่ตอนปลูกจะนำฝาหรือเข่งมาครอบไว้ไม่ให้ถูกแสงแดด มีราคาแพงกว่ากุยช่ายเขียว",
    picture_url: "https://krua.co/wp-content/uploads/2020/06/ImageBanner_1140x507_KuiChai-6.jpg",
  },
  {
    id: "30",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "แป้งอเนกประสงค์",
    description: "ได้จากการผสมข้าวสาลีชนิดแข็งกับชนิดอ่อนในสัดส่วนที่เหมาะสม ใช้ทำ ขนมปัง เค้กบางชนิด",
    picture_url: "https://img.kapook.com/u/surauch/cook1/Flour.jpg",
  },
  {
    id: "31",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำมันพืช",
    description: "ไขมันที่สกัดจากเมล็ดหรือจากส่วนอื่น ๆ (แม้จะน้อยกว่า) ของพืช เหมือนกับไขมันสัตว์ ไขมันพืชเป็นไตรกลีเซอไรด์",
    picture_url: "https://www.chonklang.com/webcms/uploads/Article/Vegetable_Oil/Soybean_Oil.jpg?1563970748152",
  },
  {
    id: "32",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ซีอิ๊วขาว",
    description: "เครื่องปรุงรสที่ทำจากถั่วเหลืองหมัก, เมล็ดข้าวย่าง, น้ำเกลือ และเชื้อรา Aspergillus oryzae หรือ Aspergillus sojae",
    picture_url: "https://static5-th.orstatic.com/userphoto/Article/0/36/000MLUA8003EF807585854j.jpg",
  },
  {
    id: "33",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำมันหอย",
    description: "มักเรียกกันติดปากว่า น้ำมันหอย เป็นซอสปรุงรสในการทำอาหาร มีลักษณะข้น หนืดและมีสีเข้ม",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/OysterSauce2.jpg/1024px-OysterSauce2.jpg",
  },
  {
    id: "34",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำตาล",
    description: "ชื่อเรียกทั่วไปของคาร์โบไฮเดรตชนิดละลายน้ำ โซ่สั้น และมีรสหวาน ส่วนใหญ่ใช้ประกอบอาหาร",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Raw_sugar_closeup.jpg/1024px-Raw_sugar_closeup.jpg",
  },
  {
    id: "35",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริกไทยป่น",
    description: "พืชที่ได้รับการยอมรับว่าเป็นราชาของเครื่องเทศที่มีกลิ่นฉุน และเป็นเครื่องเทศที่ให้รสเผ็ดร้อน สามารถนำมาทำพริกไทยแห้งเป็นเครื่องปรุงอาหาร",
    picture_url: "https://kpfoodssupply.co.th/wp-content/uploads/2018/09/009_1.jpg",
  },
  {
    id: "36",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เนื้อเป็ดย่าง",
    description: "เนื้อเป็ดย่าง เนื้อสัตว์ปีกในวงศ์นกเป็ดน้ำ (Anatidae) ปากแบน ตีนแบน ระหว่างนิ้วมีพังผืดยึดติดกัน นำมาย่างด้วยสมุนไพร",
    picture_url: "https://www.duckking.co.th/wp-content/uploads/2020/02/%E0%B9%80%E0%B8%99%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%94%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%87-03-1-560x560.jpg",
  },
  {
    id: "37",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "มะเขือเทศราชินี",
    description: "มะเขือเทศที่ผลเล็ก รสชาติหวาน เนื้อแน่นมีกลิ่นหอมต่าง และมีสารบีตา-แคโรทีน วิตามินซี และวิตามินอีสูง",
    picture_url: "http://t2.gstatic.com/licensed-image?q=tbn:ANd9GcR8j9DLByoPWvAP54G_CXtVwCbSFc-fv6EFU_8FSCbOAJFE6HsgtILgZPUCFMx-R5s8iBnQq0yvglmRmgg",
  },
  {
    id: "38",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "สับปะรด",
    description: "พืชล้มลุกชนิดหนึ่งที่มีต้นกำเนิดมาจากบริเวณทวีปอเมริกาใต้ ลำต้นมีขนาดสูงประมาณ 80–100 เซนติเมตร",
    picture_url: "http://t2.gstatic.com/licensed-image?q=tbn:ANd9GcResqISpXhaSN8U4_pOAGIuT7tb1qacxNapesnbMTFm0MncH0kWLKQzUmhm1ueBy2-W0fHAQxd7pyuBq2g",
  },
  {
    id: "39",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำตาลปี๊บ",
    description: "ส่วนผสมในอาหารและขนมที่ใช้กันทั่วในเอเชีย ตะวันออกกลางและแอฟริกาเหนือ ซึ่งให้รสหวานเหมือนน้ำตาล",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Palmsugar.jpg/413px-Palmsugar.jpg",
  },
  {
    id: "40",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริกแกงเผ็ด",
    description: "ส่วนผสมการปรุงอาหารชนิดหนึ่งของอาหารไทยประเภทแกง ทำจากเครื่องเทศและสมุนไพรต่าง ๆ เช่น พริกสด พริกแห้ง หัวหอม กระเทียม ข่า ตะไคร้ ผิวมะกรูด บดผสมให้เข้ากัน",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/HAT_YAI_MARKET_2.jpg/640px-HAT_YAI_MARKET_2.jpg",
  },
  {
    id: "41",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ลูกชิ้นหมู",
    description: "เนื้อหมูบดรีดเป็นลูกเล็ก ๆ บางครั้งก็มีส่วนผสมอื่น ๆ เช่น เกล็ดขนมปัง หัวหอม ไข่ เนย และเครื่องปรุงรส",
    picture_url: "https://i.ytimg.com/vi/DbiVhnG60Rw/maxresdefault.jpg",
  },
  {
    id: "42",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เส้นเล็ก",
    description: "แป้งข้าวเจ้ารีดเป็นแผ่นบาง ๆ นึ่งไอน้ำให้สุก แล้วตัดซอยกว้างประมาณ 1-3 มิลลิเมตร นำไปตากแห้ง",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/8/80/%E0%B8%81%E0%B9%8B%E0%B8%A7%E0%B8%A2%E0%B9%80%E0%B8%95%E0%B8%B5%E0%B9%8B%E0%B8%A2%E0%B8%A7%E0%B9%80%E0%B8%AA%E0%B9%89%E0%B8%99%E0%B9%80%E0%B8%A5%E0%B9%87%E0%B8%81_kuai_tiao_lek.JPG",
  },
  {
    id: "43",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ถั่วงอก",
    description: "ผักชนิดหนึ่งและมีคุณค่าทางอาหารสูง มีรากงอกจากเมล็ด เช่น ถั่วเขียว ถั่วดำ",
    picture_url: "https://morkeaw.net/wp-content/uploads/2021/10/%E0%B8%96%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%87%E0%B8%AD%E0%B8%81.jpg",
  },
  {
    id: "44",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "มะนาว",
    description: "พืชชนิดหนึ่ง ผลมีรสเปรี้ยวจัด จัดอยู่ในสกุลส้ม (Citrus) ผลสีเขียว เมื่อสุกจัดจะเป็นสีเหลือง เปลือกบาง",
    picture_url: "https://v3i.rweb-images.com/www.disthai.com/images/editor/71470.jpg",
  },
  {
    id: "45",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริกป่น",
    description: "ผลิตภัณฑ์ที่ได้จากการนำผลพริกที่สุกหรือแก่จัด อาจมีก้านผลติดอยู่ นำไปผึ่งแดดหรืออบให้แห้ง อาจนำไปคั่ว แล้วนำไปบด",
    picture_url: "https://health-society.com/wp-content/uploads/2020/10/%E0%B8%9E%E0%B8%A3%E0%B8%B4%E0%B8%81%E0%B8%9B%E0%B9%88%E0%B8%99%E0%B9%80%E0%B8%81%E0%B8%B2%E0%B8%AB%E0%B8%A5%E0%B8%B5-Gochugaru-1024x682.jpg",
  },
  {
    id: "46",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ถั่วลิสง",
    description: "พืชตระกูลถั่วรสหวาน ช่วยบำรุงปอดและกระเพาะอาหาร แก้ไอ ขับปัสสาวะ กระตุ้นน้ำนม เหมาะกับผู้ที่มีอาการไอแห้ง ร่างกายอ่อนแอ",
    picture_url: "https://www.rakluke.com/images/2021/pregnancy-nutrition/5441.jpg",
  },
  {
    id: "47",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "หัวหอม",
    description: "พืชหัว (bulb) ปลูกได้ในช่วงฤดูหนาว สามารถปลูกได้ในดินทุกชนิดที่มีการระบายน้ำและอากาศดี",
    picture_url: "https://morkeaw.net/wp-content/uploads/2021/09/%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B8%AB%E0%B8%AD%E0%B8%A1%E0%B9%83%E0%B8%AB%E0%B8%8D%E0%B9%88.jpg",
  },
  {
    id: "48",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "มะเขือเทศ",
    description: "พืชชนิดหนึ่งในตระกูลผลมีเนื้อหลายเมล็ด อุดมไปด้วยคุณค่าทางอาหาร มะเขือเทศขนาดปานกลางจะมีปริมาณวิตามินซีครึ่งหนึ่งของส้มโอทั้งผล",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Tomato_je.jpg/800px-Tomato_je.jpg",
  },
  {
    id: "49",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "กะหล่ำปลี",
    description: "ไม้ล้มลุกชนิด Brassica oleracea L. var. capitata ในวงศ์ Cruciferae มีสัณฐานกลม ส่วนใหญ่สีเขียว",
    picture_url: "https://www.picturethisai.com/image-handle/website_cmsname/image/1080/154040196113891347.jpeg?x-oss-process=image/format,webp",
  },
  {
    id: "65",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "แตงกวา",
    description: "ไม้เลื้อยในวงศ์ Cucurbitaceae (วงศ์เดียวกันกับแตงโม ฟักทอง บวบ มะระ น้ำเต้า) มีถิ่นกำเนิดในประเทศอินเดีย นิยมปลูกเพื่อใช้ผลเป็นอาหาร",
    picture_url: "http://www.thaiall.com/blogacla/wp-content/uploads/2016/08/bb1-1.jpg",
  },
  {
    id: "50",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ขึ้นฉ่าย",
    description: "พืชล้มลุกชอบพื้นที่ลุ่ม อยู่ในวงศ์ Apiaceae เป็นผักและสมุนไพรที่มีกลิ่นหอม นิยมใช้ในการปรุงอาหารที่ต้องการดับกลิ่นคาว หรือเพิ่มความหอมของน้ำซุป",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Snijselderij_Apium_graveolens.jpg/360px-Snijselderij_Apium_graveolens.jpg",
  },
  {
    id: "51",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "โบโลน่า",
    description: "ไส้กรอกชนิดหนึ่งที่ดัดแปลงมาจากมอร์ตาเดลลา ซึ่งเป็นไส้กรอกขนาดใหญ่ที่ทำจากเนื้อหมูบดละเอียด มีไขมันหมูชิ้นเล็ก ๆ ผสมอยู่",
    picture_url: "https://f.ptcdn.info/814/012/000/1385900907-P1000950re-o.jpg",
  },
  {
    id: "52",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "มาม่าเผ็ดเกาหลี",
    description: "บะหมี่กึ่งสำเร็จรูปรสไก่เผ็ดจากเกาหลีหรือมาม่าแห้งแบบเผ็ดรสไก่ ตัวซองเป็นสีดำพร้อมรูปมาม่าและเปลวไฟ แถมแพ็กเกจรุ่นหลังๆ จะมีรูปไก่พ่นไฟมาการันตีความเผ็ด",
    picture_url: "https://static5-th.orstatic.com/userphoto/Article/0/3H/000ORI67AB4CB9A975F88Aj.jpg",
  },
  {
    id: "53",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ต้นหอม",
    description: "พืชล้มลุกขนาดเล็กตระกูลเดียวกับกระเทียม มีหัวสีขาวบ้างก็ปนสีม่วงอยู่ใต้ดิน กินได้ทั้งใบ ดอก และหัว มีกลิ่นฉุนและรสซ่า นิยมนำไปกินเป็นผักเคียงกับอาหารชนิดอื่น ๆ",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/5/57/GreenOnions.jpg",
  },
  {
    id: "54",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "งาขาว",
    description: "พืชล้มลุก ผลเป็นฝัก มีเมล็ดเล็กๆ สีขาว สีดำ และสีแดง มีการเพาะปลูกมานานเพราะต้องการใช้เมล็ดงานี้เป็นอาหาร เครื่องเทศ",
    picture_url: "https://static.hd.co.th/system/blog_articles/main_hero_images/000/004/138/original/iStock-892994676_%281%29.jpg",
  },
  {
    id: "55",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "สาหร่าย",
    description: "ลักษณะคล้ายพืช แต่ไม่มีส่วนที่เป็นราก ลำต้น และใบที่แท้จริง มีขนาดตั้งแต่เล็กมากมีเซลล์เดียว นำมาอาแห้งตกแต่งอาหาร",
    picture_url: "https://chillchilljapan.com/wp-content/uploads/2020/10/pixta_65732171_M.jpg",
  },
  {
    id: "56",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ผักกาดหอม",
    description: "พืชในวงศ์ Asteraceae ลำต้นเตี้ย แต่ส่วนที่เจริญมากที่สุดคือใบ แต่ละสายพันธุ์ก็มีช่วงฤดูกาลที่เหมาะสมไม่เหมือนกัน",
    picture_url: "https://www.tastingtable.com/img/gallery/why-you-should-consider-cooking-your-lettuce/intro-1671048710.jpg",
  },
  {
    id: "57",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ซอสสไปซี่เกาหลี",
    description: "ซอสปรุงอาหารรสเผ็ดจากเกาหลี่นิยมนำมาประกอบอาหารกับเนื้อสัตว์ เพื่อเพิ่มความรสจัดให้กับอาหาร",
    picture_url: "https://krua.co/wp-content/uploads/2022/08/RI1773_Gallery_-01_Artboard-01-scaled.jpg",
  },
  {
    id: "58",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เนื้อหมู",
    description: "เนื้อที่มาจากหมู สามารถนำมาทำอาหาร ถือเป็นเนื้อที่นิยมบริโภคมากที่สุด เป็นสิ่งต้องห้ามในศาสนาอิสลาม และยิว",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Wollschwein_09.11.2015_17-27-15.JPG/1024px-Wollschwein_09.11.2015_17-27-15.JPG",
  },
  {
    id: "59",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ข้าวญี่ปุ่น",
    description: "เมล็ดของพืชหญ้า Oryza sativa (ชื่อสามัญ: ข้าวเอเชีย) ที่พบมากในทวีปเอเชีย ข้าวเป็นธัญพืชซึ่งประชากรโลกบริโภคเป็นอาหารสำคัญ",
    picture_url: "https://s.isanook.com/jp/0/ui/0/3967/ec5f693c077293e6fe0eb09884169c4c_1524935915.jpg",
  },
  {
    id: "60",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ซอสปรุงรส",
    description: "ของเหลว, ครีม หรืออาหารกึ่งของแข็งที่ใช้ประกอบหรือใช้ในการทำอาหาร ปกติจะไม่รับประทานน้ำปรุงรส แต่จะใช้ปรุงแต่งรสชาติ",
    picture_url: "https://halalthai.or.th/storages/products/191237.jpg",
  },
  {
    id: "61",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำมันงา",
    description: "น้ำมันพืชสกัดจากเมล็ดงาที่ใช้รับประทานได้ นิยมใช้ปรุงรสอาหาร มีกลิ่นและรสชาติออกคล้ายถั่ว ในปัจจุบันก็ยังจำกัดเพราะต้องเก็บเกี่ยวผลิตผลด้วยมืออย่างไม่มีประสิทธิภาพ",
    picture_url: "https://sukkaphap-d.com/wp-content/uploads/2016/07/soybean-oil.jpg",
  },
  {
    id: "62",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ผักโขม",
    description: "พืชในวงศ์ Amaranthaceae ผักโขมจะขึ้นอยู่ทั่วไปตามแหล่งธรรมชาติเช่น ป่าละเมาะ ริมทาง ชายป่าที่รกร้าง เป็นต้น และยังขึ้นเป็นวัชพืชในบริเวณสวนผัก สวนผลไม้",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Amaranthus_lividus.JPG/330px-Amaranthus_lividus.JPG",
  },
  {
    id: "63",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เห็ดหอม",
    description: "สิ่งมีชีวิตจำพวกเห็ดรา ซึ่งเราสามารถรับประทานได้ นิยมนำมาใช้ประกอบอาหารโดยเฉพาะอาหารจีนและอาหารญี่ปุ่น สามารถนำไปตากแห้งเพื่อให้เก็บไว้ได้นาน",
    picture_url: "https://www.bloggang.com/data/jazzy-bong/picture/1324539274.jpg",
  },
  {
    id: "64",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เห็ดเข็มทอง",
    description: "เห็ดรูปร่างกลม มีขนาดเล็กก้านยาวเรียว เกิดรวมกันเป็นกลุ่ม ดอกเห็ดในธรรมชาติมีสีเหลือง - ส้ม น้ำตาล - แดง หมวกเล็กลำต้นสั้น",
    picture_url: "https://arit.kpru.ac.th/ap2/local/contents/Herbs_kpp/thumbs/thumb_049.webp",
  },
  {
    id: "66",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "แครอท",
    description: "แครอท ผักจำพวกรากที่โดยทั่วไปมีสีส้ม แต่ก็ปรากฏพันธุ์ปลูกสีม่วง ดำ แดง ขาว และเหลืองด้วย ทั้งหมดนี้ได้รับการปรับปรุงพันธุ์มาจากแคร์รอตป่า ซึ่งมีถิ่นกำเนิดอยู่ในยุโรปและเอเชียตะวันตกเฉียงใต้",
    picture_url: "https://alwafd.news/images/thumbs/828/news/cf0bd764b215c9cb929818debc58e8de.jpg",
  },
  {
    id: "67",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำส้มสายชู",
    description: "เป็นของเหลวที่ได้จากกระบวนการหมัก มีองค์ประกอบหลักคือกรดน้ำส้ม (กรดอะซิติก) น้ำส้มสายชูทั่วไปมีความเข้มข้นของกรดตั้งแต่ 4% ถึง 8% โดยปริมาณ",
    picture_url: "https://th.anngle.org/wp-content/uploads/2022/09/3109567_s.jpg",
  },
  {
    id: "68",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ไข่ไก่",
    description: "อาหารที่มนุษย์ชาติรับประทานมานับสหัสวรรษ ไข่นกและสัตว์เลื้อยคลานประกอบด้วยเปลือกไข่ที่ทำหน้าที่ปกป้องอันตรายต่อไข่, ไข่ขาวและไข่แดง",
    picture_url: "https://s.isanook.com/he/0/rp/rc/w670h402/yatxacm1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL2hlLzAvdWQvMS81NDA5L3RodW1iX2VnZ3MuanBn.jpg",
  },
  {
    id: "69",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "กิมจิ",
    description: "ของกินตามประเพณีในอาหารเกาหลี ประกอบด้วย ผัก เช่น ผักกาดขาวและหัวไชเท้า ที่หมักดองด้วยเกลือและเครื่องปรุงอื่น ๆ",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Korean_Gimchi01.jpg/800px-Korean_Gimchi01.jpg",
  },
  {
    id: "70",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "เส้นหมี่",
    description: "เส้นก๋วยเตี๋ยวที่ทำจากข้าว มีลักษณะเป็นเส้นกลมสม่ำเสมอสีขาว เส้นเล็กและยาว คล้ายวุ้นเส้นแต่ไม่มีความใส",
    picture_url: "https://s.isanook.com/wo/0/rp/r/w728/ya0xa0m1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL3dvLzAvdWQvMzcvMTg5NDY1L2lzdG9jay0xNTU0MzM1NjQuanBn.jpg",
  },
  {
    id: "71",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำสต็อกหมู",
    description: "อาหารที่ทำมาจากเนื้อสัตว์ หรือเนื้อหมู เป็นส่วนประกอบที่สำคัญในการทำแกง ก๋วยเตี๋ยว และอีกหลายอย่าง",
    picture_url: "https://เมนู.net/media/images/recipe/%E0%B9%80%E0%B8%A1%E0%B8%99%E0%B8%B9%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%AA%E0%B8%95%E0%B9%8A%E0%B8%AD%E0%B8%81%E0%B8%AB%E0%B8%A1%E0%B8%B9.jpg",
  },
  {
    id: "72",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ตั้งฉ่าย",
    description: "ผักดองแบบจีนที่นิยมใส่ในก๋วยเตี๋ยว ข้าวต้มเครื่อง และยำแบบจีน มีต้นกำเนิดจากเทียนจิน ประเทศจีน ทำจากผักกาดขาวหรือผักหางหงส์",
    picture_url: "https://v3i.rweb-images.com/www.disthai.com/images/content/original-1634801804878.jpg",
  },
  {
    id: "73",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "กระเทียมเจียว",
    description: "พืชสมุนไพรไทย เป็นเครื่องเทศชนิดหนึ่ง ที่เป็นที่รู้จักกันดี เป็นพืชล้มลุก มีหัวใต้ดิน มีกลิ่นแรง มีกลิ่นฉุนจัด นำมาเจียวในน้ำมันพักไว้",
    picture_url: "https://www.thai-thaifood.com/bilder/4236c.jpg",
  },
  {
    id: "74",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ผักชี",
    description: "พืชล้มลุกขนาดเล็กในวงศ์ Apiaceae ใบติดกับลำต้น มีใบย่อยเป็นจำนวนมาก ใบหยักลึกเข้าหากลางใบ ดอกช่อ ดอกย่อยสีขาวอมชมพู",
    picture_url: "https://thaicityfarm.com/wp-content/uploads/2020/09/Coriander_NP.jpg",
  },
  {
    id: "75",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำยำปลาร้า",
    description: "น้ำยำสำหรับใช้ในเมนูยำ จากการต้มน้ำปลาร้าแล้วกรองแล้วนำมาผสมวัตถุดิบยำทำเป็นน้ำยำ",
    picture_url: "https://i.ytimg.com/vi/bO4EIxkVtrY/maxresdefault.jpg",
  },
  {
    id: "76",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ขนมจีน",
    description: 'อาหารคาวชนิดหนึ่ง ทำด้วยแป้งเป็นเส้นกลม ๆ คล้าย เส้นหมี่ กินกับน้ำยา น้ำพริก เป็นต้น อาหารชนิดนี้ ภาษาเหนือเรียก "ขนมเส้น" ภาษาอีสานเรียก "ข้าวปุ้น" และภาคใต้เรียก "หนมจีน"',
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/d/d9/Khanom_Chin_-_Thai_rice_noodles.JPG",
  },
  {
    id: "77",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ปลาทูทอด",
    description: "ปลาชนิดหนึ่งที่นิยมนำมาทำเป็นอาหาร นำเนื้อปลาทูมาทอดเพื่อเป็นเนื้อวัตถุดิบ",
    picture_url: "https://img.wongnai.com/p/1968x0/2019/01/23/4d10a934bb634a8a9b3ae8cefaf7c85e.jpg",
  },
  {
    id: "78",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ถั่วฝักยาว",
    description: "ถั่วชนิดหนึ่งที่เป็นไม้เลื้อย มีชื่อสามัญในภาษาต่างๆที่หลากหลาย เช่น สิบสองปันนาเรียก ถั่วลิ้นนาค ภาษาอังกฤษเรียกว่า yardlong bean",
    picture_url: "https://backoffice.thaiselect.com/upload/IList/thumbnail_picture/ingredient_ce3f16fe8064a4f548663c44856873c0.png",
  },
  {
    id: "79",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "พริกขี้หนู",
    description: "พืชในวงศ์ Solanaceae มีลักษณะเป็นไม้ต้น ใบมีลักษณะแบนและเรียบมัน ผลมีขนาดเล็กเรียวยาว มีรสเผ็ดจัด",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Thai_peppers.jpg/1200px-Thai_peppers.jpg",
  },
  {
    id: "80",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น้ำมะนาว",
    description: "พืชชนิดหนึ่ง ผลมีรสเปรี้ยวจัด จัดอยู่ในสกุลส้ม (Citrus) ผลสีเขียว เมื่อสุกจัดจะเป็นสีเหลือง เปลือกบาง นำมาคั้นน้ำ",
    picture_url: "https://image.springnews.co.th/uploads/images/md/2018/07/PBdzbizGhU9KNryc0gpg.jpg?x-image-process=style/lg",
  },
  {
    id: "81",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ไส้กรอก",
    description: 'มาจากรากคำภาษาลาตินว่า Salsus หมายถึง "การเก็บรักษาเนื้อสัตว์โดยใช้เกลือ" เป็นเนื้อสัตว์บดละเอียดผสมกับเกลือและเครื่องเทศ บรรจุลงในไส้',
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Falukorv.jpg/1024px-Falukorv.jpg",
  },
  {
    id: "82",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ข้าวสวย",
    description: "ข้าวที่ผ่านกระบวนการนึ่ง หรือการต้มให้เดือด อย่างใดอย่างหนึ่ง ข้าวสวยเป็นอาหารหลักในหลายประเทศ",
    picture_url: "https://d1sag4ddilekf6.azureedge.net/compressed_webp/items/THITE2021050405452878828/detail/menueditor_item_5e0c1839879e4fa8a7302b1c2c46c303_1620107042910405854.webp",
  },
  {
    id: "83",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "น่องไก่เล็ก",
    description: "เนื้อสัตว์ที่มาจากไก่ได้รับความนิยมในอาหารทั่วโลก สามารถดัดแปลงเป็นอาหารได้หลากหลายประเภท เนื้อติดกระดูกส่วนน่อง",
    picture_url: "https://cf.shopee.sg/file/87f8bfd4cc241281ef1f41d1708dd7f5",
  },
  {
    id: "84",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ซอสมะเขือเทศ",
    description: "ซอสที่ทำจากมะเขือเทศเป็นส่วนประกอบหลัก ใช้สำหรับเติมรสเปรี้ยวอมหวานให้กับอาหาร นิยมนำมาเป็นเครื่องปรุงในหลายประเทศ",
    picture_url: "https://cdn.shopify.com/s/files/1/0017/9234/4153/products/Tomato-Sauce_1000x.jpg?v=1587722574",
  },
  {
    id: "85",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ลูกเกด",
    description: "องุ่นแห้ง ที่มีการผลิตในหลายพื้นที่ทั่วโลก และสามารถรับประทานเปล่าๆ หรือจะใช้ในการทำอาหาร การอบขนม และการหมักบ่มก็ได้",
    picture_url: "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Sunmaid-Raisin-Pile.jpg/800px-Sunmaid-Raisin-Pile.jpg",
  },
  {
    id: "86",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ถั่วลันเตา",
    description: "พืชในตระกูลถั่วมีถิ่นกำเนิดแถบประเทศเอธิโอเปีย ต่อมาแพร่กระจายปลูกในแถบ เมดิเตอร์เรเนียน เอเชีย และเขตอบอุ่นต่างๆ ของโลก",
    picture_url: "https://morkeaw.net/wp-content/uploads/2021/08/%E0%B8%96%E0%B8%B1%E0%B9%88%E0%B8%A7%E0%B8%A5%E0%B8%B1%E0%B8%99%E0%B9%80%E0%B8%95%E0%B8%B2.jpg",
  },
  {
    id: "87",
    created_at: "2023-03-01 15:44:53.616417+00",
    name: "ข้าวโพด",
    description: "พืชตระกูลเดียวกับหญ้ามีลำต้นสูง โดยเฉลี่ย 2.2 เมตร ขนาดเส้นผ่าศูนย์กลางของลำต้น 0.5–2.0 นิ้ว เมล็ดจากฝักใช้เป็นอาหารคนและสัตว์",
    picture_url: "https://thainews.prd.go.th/dc/transcode/image/2563/6/2/45712904d0579886c00fc6e1a1806e82_small.jpg",
  },
]);

const foodsList = ref([
  {
    id: "2948",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวผัดปู ",
    description: "เมนูทำง่ายทานง่าย สำหรับคนชอบเนื้อปูเน้นๆ ทานกับข้าวผัดร้อนๆ",
    picture_url: "https://img.wongnai.com/p/1920x0/2017/06/15/e127e044133643ab84e7fc7600c53739.jpg",
    tag: JSON.parse('["อาหารเช้า","ทำง่าย","ไข่ไก่"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["เนื้อปูสุก","ข้าวสวย","ไข่ไก่","แครอท","ต้นหอม","เกลือ","ซีอิ๊วขาว","พริกไทย","น้ำมันพืช","กระเทียม"]'),
    step: "*เตรียมวัตถุดิบให้พร้อม สับกระเทียม แครอท และซอยต้นหอมเตรียมไว้\n*นำข้าวไปผึ่งลมก่อนนำมาผัด หรือเป็นข้าวสวยแช่เย็นเพื่อให้ข้าวเป็นเม็ดสวยไม่เฉะ\nวิธีทำ\n1. ใส่น้ำมันลงในกระทะ ใส่กระเทียมสับผัดจนหอม ใส่ใข่ไก่ลงไปยีพอให้ไข่สุก แล้วใส่ข้าวสวยลงตามไปผัด คลุกเคล้าให้เข้ากัน\n2. ปรุงรสด้วย เกลือ ซีอิ๊ว พริกไทย ผัดให้เข้ากัน ด้วยไฟแรง ใส่เนื้อปูสุกลงไป ผัดจนข้าวดีดจากกระทะถือว่าใช้ได้ แล้วปิดเตา\n3.ใส่ต้นหอมซอย ตักใส่จาน พร้อมทานแล้ว\n4. เพิ่มส่วนประกอบตามชอบได้เลย ",
    userList: "",
  },
  {
    id: "2949",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวจี่พันเบคอน ",
    description: "เมนูแปลกใหม่ ผสานสไตล์ข้าวจี่อีสานกับเบค่อน หอมน่าทาน ทำสนุก ",
    picture_url: "https://img.wongnai.com/p/1920x0/2023/02/24/7315d09142a94c5087986fad67c90900.jpg",
    tag: JSON.parse('["แปรกใหม่","เมนูข้าวเหนียว","อาหารทานเล่น"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["ข้าวเหนียว","น้ำเปล่า","หัวกะทิ","เกลือ","เบคอน","ไข่เป็ด","ไข่ไก่","ซอสปรุงรส","น้ำตาล","เนยจืด"]'),
    step: "*มีการใช้หวดนึ่งข้าวเหนียว และกระทะหรือเตาสำหรับย่าง\n*ต้มน้ำร้อนไว้พรมข้าวเหนียว\nวิธีทำ\n1. ล้างทำความสะอาดข้าวเหนียวจนน้ำใส แล้วแช่ไว้ 30-40 นาทีจากนั้นตั้งหวดนึ่งข้าวเหนียว 40 นาที โดยใน 20 นาทีแรกให้กลับด้านและคอยพรมน้ำร้อนจนสุก \n2. การมูนข้าวเหนียว โดยนำข้าวเหนียวที่ได้มาใส่อ่างผสม แล้วเทหัวกระทิกับเกลือลงไป คนจนข้าวเหนียวดูดกระทิจนหมด (หัวกระทิ 50 มล. ต่อข้าวเหนี่ยว 250 กรัม และต่อเกลือ 1 ช้อนชา)\n3. ปั้นข้าวเหนียวเป็น 3 เหลี่ยม หรือรูปทรงที่ต้องการ\n4. ตอกไข่ไก่และไข่เป็ดลงชามผสม ปรุงรสด้วยซอสปรุงรส ผงปรุงรส และน้ำตาล ตีผสมให้เข้ากันเพื่อเอาไว้ทา\n5. ตั้งกระทะสำหรับจี่ ทาเนยให้ทั่วกระทะ หรือถ้าใครมีเตาย่างก็สามารถใช้ได้\n6. วางข้าวเหนียวที่ปั้นเตรียมไว้ลงไปจี่ คอยทาส่วนผสมไข่ที่เตรียมไว้ให้ทั่วทั้งชิ้น พลิกกลับด้านไปมาแล้วทาไข่ซ้ำจนได้สีเหลืองสวย \n7. นำข้าวจี่ขึ้นจากเตา พันด้วยเบคอนแล้วนำกลับลงไปจี่ในกระทะอีกครั้ง จนเบคอนเริ่มขึ้นสีน้ำตาลสวยงาม เท่านี้ก็ทานได้แล้ว",
    userList: "",
  },
  {
    id: "2970",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ผัดมาม่า",
    description: "เมนูง่าย ๆ เหมาะเป็นอาหารช่วงปลายเดือน",
    picture_url: "https://cdn.discordapp.com/attachments/969176598752407565/1081492837553688656/4857A68B-E866-4AE5-894F-DDB0A1001AD3.jpg",
    tag: JSON.parse('["ทำง่าย","มาม่า","เด็กหอ"]'),
    source: "easycookingmenu",
    ingredient: JSON.parse('["น้ำมันพืช","ไข่","มาม่า","ซอสปรุงรส","ต้นหอม","ผักชี"]'),
    step: "แช่เส้นมาม่าในน้ำเปล่าจนนิ่มประมาณ 5 นาที ตั้งกระทะใส่น้ำมันพืชเล็กน้อย ใส่ไข่ไก่ลงไปผัดจนเริ่มสุก จากนั้นใส่เส้นมาม่าที่แช่ไว้ ใส่ผงเครื่องปรุงมาม่า ซอสปรุงรส ต้นหอม จากนั้นผัดให้เข้ากัน",
    userList: "",
  },
  {
    id: "2994",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "หมูผัดบล็อคโคลี",
    description: "ทำงาย สไตล์เด็กหอ",
    picture_url: "https://img.wongnai.com/p/1968x0/2019/05/12/3c8a708c5a8c427c9e28eeca85bedac6.jpg",
    tag: JSON.parse('["หมู","บล็อคโคลี","ทำง่าย"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["หมู","บล็อคโคลี","น้ำมันหอย","น้ำตาล","ซอสปรุงรส","กระเทียม","น้ำเปล่า"]'),
    step: "1.ตั้งกระทะให้ร้อนเเละใส่กระเทียม 2.นำหมูที่สับเเล้วลงในกระทะ 3.ใส่บล็อคโคลีลงไป และทำการใส่น้ำมันหอยและซอสปรุงรสลงไป จากนั้นปรุงรสตามชอบ 4.เทน้ำเปล่าลงไปเล็กน้อยเพื่อไม่ให้เค็มจนเกินไป 5.ผัดต่อเล็กน้อย พร้อมทาน",
    userList: "",
  },
  {
    id: "2990",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "อกไก่ต้มคลีน",
    description: "ทำงายมาก โปรตีนเน้นๆ",
    picture_url: "https://img.wongnai.com/p/1968x0/2018/05/13/35cb981907e441c3876dae696236a17b.jpg",
    tag: JSON.parse('["ทำง่าย","ต้ม","สุขภาพดี"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["อกไก่","มะนาว","ซีอิ๊วขาว","น้ำตาลทราย","ขิง","พริกสด","เต้าเจี๊ยว"]'),
    step: "1.จต้มน้ำให้เดือดแล้วใส่ไก่ลงไป 2.ระหว่างรอไก่สุกให้ทำน้ำจิ้มรอ โดยใส่ซีอิ๊วขาว น้ำตาลทราย มะนาว ขิงหั่น พริกหั่น และเต้าเจี๊ยว 3.พอไก่สุกนำมาหั่นเเละทานคู่กับน้ำจิ้ม",
    userList: "",
  },
  {
    id: "2978",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "มาม่าคาโบนาร่า",
    description: "เมนูเด็กหอ",
    picture_url: "https://pbs.twimg.com/media/E1wgdkLUYAIJdaU?format=jpg&name=large",
    tag: JSON.parse('["ไข่","เด็กหอ"]'),
    source: "CookClick",
    ingredient: JSON.parse('["เบคอน","หัวหอม","วิปครีม","มาม่า","พาเมซานชีส","ไข่"]'),
    step: "ตั้งกระทะ นำเบคอนลงไปเจียวใส่หัวหอม \nหั่นลงไปผัด ผัดจนหอมตามด้วยใส่วิปครีมลงไป \nปล่อยให้เดือด ใส่เส้นมาม่าลงไป ปิดเตาใส่พาเมซาน \nตอกไข่แดง และคลุกให้เข้ากันโรยเบคอยที่เจียวไว้ตอนแรก",
    userList: "",
  },
  {
    id: "2953",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ไข่ต้มดองซีอิ๊ว",
    description: "เมนูเรียกน้ำย่อย ความอร่อยจากแดนไกล กับไข่ต้มดองซีอิ๊วสไตล์เกาหลี ที่ดองด้วยไข่ต้มอร่อย ๆ กับน้ำซอสซีอิ๊ว ดองให้เข้าเนื้อ แล้วนำไปรับประทานกับข้าวสวยร้อน ๆ",
    picture_url: "https://www.cpbrandsite.com/contents/images/bbpxtlingc8qlbxezidqvm8oqkhhu3qbubuq84ao.png",
    tag: JSON.parse('["ไข่ไก่"]'),
    source: "CPBrandsite, Food TrueID",
    ingredient: JSON.parse('["ไข่ไก่","น้ำเปล่า","ขิงแก่","ต้นหอม","น้ำตาล","ซีอิ๊วขาว","งาขาว","พริก","กระเทียม"]'),
    step: "*ใช้พริกอะไรก็ได้ หั่นเป็นแว่น ซอยขิงแก่ และหั่นกระเทียมเป็นแผ่นบาง\nวิธีทำ\n1. ต้มไข่ให้สุกเป็นไข่ต้ม จากนั้นพักไว้(ใส่เกลือและน้ำส้มสายชูเพื่อให้ปอกง่าย)\n2. ตั้งน้ำเปล่าให้เดือด ใส่ซีอิ๊วขาว น้ำตาลทราย คนจนละลาย\n3. ใส่ขิงแก่ซอย และกระเทียมที่เตรียมไว้ลงไป คนส่วนผสมเข้าด้วยกันจนหอม แล้วปิดเตา\n4. ระหว่างรอให้น้ำซอสหายร้อน ให้ปอกเปลือกไข่ไว้รอ\n5. ทน้ำซอสในกล่องที่จะใช้ดอง และใส่ไข่ลงไป ตามด้วยพริก ต้นหอมซอย งาที่เตรียมไว้ แล้วนำไปแช่ในตู้เย็น 5-6 ชั่วโมง หรือแช่ไว้ข้ามวัน แค่นี้ก็พร้อมรับประทานแล้ว",
    userList: "",
  },
  {
    id: "2965",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ยำไข่ดาว",
    description: "อาหารอร่อย ทำง่าย สไตล์เด็กหอ",
    picture_url: "https://www.easycookingmenu.com/images/10idea06.jpg",
    tag: JSON.parse('["ทำง่าย","ไข่ไก่","เด็กหอ"]'),
    source: "easycookingmenu",
    ingredient: JSON.parse('["พริกขี้หนู","มะเขือเทศราชินี","น้ำปลา","น้ำตาล","มะนาว","หอมหัวใหญ่","หมูสับ","ไข่ไก่","ขึ้นฉ่าย"]'),
    step: "- เตรียมวัตถุดิบให้เรียบร้อย (ทอดไข่ดาว รวนหมูสับ)\n- ทำน้ำยำ โดยใส่พริกขี้หนู มะเขือเทศราชินี น้ำปลา น้ำตาล มะนาว หอมหัวใหญ่ ลงไปตามลำดับนี้เลย\n- ใส่หมูสับรวนสุก แล้วคลุกเคล้าให้เข้ากัน\n- ใส่ไข่ดาวที่หั่นไว้ลงไปในน้ำยำ\n- คลุกเบาๆพอให้น้ำยำโดนไข่ดาว\n- โรยหน้าด้วยขึ้นฉ่าย",
    userList: "",
  },
  {
    id: "2956",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "แกงเผ็ดเป็ดย่าง",
    description: "รสชาติจัดจ้าน เนื้อเป็ดย่างเครื่องเทศ สไตล์ฮ่องกง เนื้อเป็ดไร้กระดูก ทำง่าย ทานง่ายสุด ๆ",
    picture_url: "https://aomkhemm.files.wordpress.com/2015/07/21.jpg",
    tag: JSON.parse('["เมนูแกง","เป็ดย่างเครื่องเทศ","อาหารจากเนื้อเป็ด"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["เนื้อเป็ดย่าง","หัวกะทิ","หางกะทิ","มะเขือเทศราชินี","โหระพา","สับปะรด","พริกชี้ฟ้า","ใบมะกรูด","มะเขือพวง","น้ำตาลปี๊บ","พริกแกงเผ็ด","น้ำปลา","น้ำมันพืช"]'),
    step: "ตั้งกระทะด้วยไฟกลาง ใส่น้ำมันพืช ตามด้วยพริกแกง ผัดจนได้กลิ่นหอมพริกแกง จากนั้นใส่หัวกะทิลงไป ผัดจนกะทิแตกมัน แล้วใส่มะเขือพวง สับปะรด มะเขือเทศราชินี ใบมะกรูด พริกชี้ฟ้า ปรุงรสด้วย น้ำปลาและน้ำตาลปี๊ป คนให้เข้ากันรอจนน้ำแกงเดือด จากนั้นใส่เนื้อเป็ดย่าง",
    userList: "",
  },
  {
    id: "2955",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "เต้าหู้ไข่ผัดกุยช่ายขาว",
    description: "เมนูผัดสำหรับคนชอบกลิ่นกุยช่าย บวกกับเต้าหู้ไข่เป็นอะไรที่เข้ากันมาก ๆ กินกับข้าวสวยร้อน ๆ ",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/igwzovjk0b3xbjlkn9gdg5y0aqcx1bygvefeue6k.png",
    tag: JSON.parse('["เมนูผัด","กุยช่ายขาว","เต้าหู้ไข่"]'),
    source: "CPBrandsite,Wongnai",
    ingredient: JSON.parse('["เต้าหู้ไข่","กุยช่ายขาว","กระเทียม","แป้งอเนกประสงค์","น้ำมันพืช","ซีอิ๊วขาว","น้ำมันหอย","น้ำตาล","พริกไทยป่น","พริก"]'),
    step: "ตั้งกระทะใส่น้ำมันพืชด้วยไฟกลาง นำเต้าหู้ไช่ไก่มาชุบแป้งอเนกประสงค์ลงทอดให้เหลือง แล้วนำขึ้นมาพัก นำกะเทียมลงเจียวในน้ำมัน ใส่กุ้ยช่ายขาว พริกแดงซอย ผัดจนสุก ปรุงรสด้วย ซีอิ๊วขาว น้ำมันหอย น้ำตาล พริกไทยป่น ผัดให้เข้ากัน ใส่เต้าหู้ไข่ ผัดเบาๆให้เข้ากัน",
    userList: "",
  },
  {
    id: "2957",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "เส้นเล็กแห้งต้มยำลูกชิ้นหมู",
    description: "เมนูเด็ดลูกชิ้นหมูเสิร์ฟพร้อมน้ำซุปและซอสต้มยำนัว ๆ ทำง่ายน่ารับประทาน",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/szzjgf8oxaxilq8gwlkvuknzy6daasxc0tt8h7lp.png",
    tag: JSON.parse('["เมนูต้มยำ","ลูกชิ้นหมู","น้ำซุป"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["ลูกชิ้นหมู","เส้นเล็ก","ถั่วงอก","น้ำตาล","น้ำปลา","มะนาว","พริกป่น","ถั่วลิสง"]'),
    step: "ตั้งน้ำให้เดือด ลวกเส้นเล็ก ถั่วงอกและลูกชิ้นหมู จากนั้นจัดเรียงใส่ชามที่จะเสิร์ฟแล้วพักไว้ ทำซอสต้มยำแห้งด้วยการ นำน้ำปลา น้ำตาลทราย น้ำมะนาว พริกป่น ถั่วลิสง ผสมให้เข้ากัน ราดน้ำยำลงในชามก๋วยเตี๋ยวลูกชิ้นหมู",
    userList: "",
  },
  {
    id: "2958",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ยำลูกชิ้นหมูแซ่บ",
    description: "สูตรทำทานเองได้ง่าย ๆ โดยมีวัตถุดิบหลักคือ ลูกชิ้นหมูและเครื่องยำรสชาติจี๊ดจ๊าดถึงใจ",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/w7tt0jffeqkiwxrl2t3eppttyckwsannbhxoxydz.png",
    tag: JSON.parse('["เมนูยำ","ลูกชิ้นหมู","เมนูรสจัด"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["ลูกชิ้นหมู","หัวหอม","มะเขือเทศ","กะหล่ำปลี","พริก","น้ำตาล","น้ำปลา","มะนาว","ขึ้นฉ่าย"]'),
    step: "ตั้งน้ำให้เดือด ลวกลูกชิ้นหมูพอสุก ซอยกะหล่ำปลี หั่นหอมและมะเขือเทศ ทำน้ำยำด้วยการตำพริกแล้วจึงนำน้ำปลา น้ำมะนาวและน้ำตาลมาผสม นำลูกชิ้น กะหล่ำปลี มะเขือเทศ หัวหอม ขึ้นฉ่าย มาคลุกเคล้ากับน้ำยำให้เข้ากัน",
    userList: "",
  },
  {
    id: "2960",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวยำซอสสไปซี่เกาหลี",
    description: "เมนูทำทานเองได้ง่าย ๆ เสิร์ฟความฟินพร้อมซอสสไปซี่โคชูจัง อร่อยเหมือนได้นั่งทานอยู่กลางเมียงดง",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/bsbkd0u5l2uwgf9rtupsqlpm7gx2mdbz9r28pzjw.png",
    tag: JSON.parse('["เมนูข้าวยำ","ซอสสไปซี่เกาหลี","มาม่าเกาหลี"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["ซอสสไปซี่เกาหลี","เนื้อหมู","ข้าวญี่ปุ่น","พริกไทยป่น","ซอสปรุงรส","น้ำมันงา","ผักโขม","เห็ดหอม","ถั่วงอก","เห็ดเข็มทอง","แตงกวา","แครอท","น้ำตาล","น้ำส้มสายชู","ไข่ไก่","กิมจิ"]'),
    step: "หมักหมูด้วยการนำ หมูสไลด์ใส่ลงในชามสำหรับหมัก ปรุงรสด้วย พริกไทย ซอสปรุงรส และน้ำมันงา คลุกเคล้าให้เข้ากัน ดองผักด้วยการนำ น้ำตาลผสมกับน้ำส้มสายชู คนให้เข้ากัน แล้วราดลงบนผักโขม เห็ดหอม ถั่วงอก เห็ดเข็มทอง แตงกวา และแครอท นำกระทะตั้งไฟกลาง นำหมูสไลด์ที่หมักไว้มาผัดให้สุก จากนั้นนำกระทะตั้งไฟกลาง เทน้ำมันงาเล็กน้อย ผัดผักทีละชนิด ให้สุก แล้วแยกพักไว้ ตักข้าวใส่ภาชนะสำหรับเสิร์ฟ จัดเรียงผักและหมูให้สวยงาม เสร็จแล้วใส่ซีพี ซอสสไปซี่เกาหลีลงตรงกลาง และสุดท้ายตอกไข่ไก่ลงตรงกลาง",
    userList: "",
  },
  {
    id: "2964",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวคลุกไข่ต้ม",
    description: "วัตถุดิบน้อย อุปกรณ์น้อย ทำง่าย",
    picture_url: "https://www.easycookingmenu.com/images/10idea09.jpg",
    tag: JSON.parse('["ทำง่าย","ไข่ไก่","เด็กหอ"]'),
    source: "easycookingmenu",
    ingredient: JSON.parse('["ข้าวสวย","ไข่ไก่","น้ำปลา","หอมแดง","พริกขี้หนู","น้ำตาล","มะนาว"]'),
    step: "- นำไข่ไปต้มให้สุก\n- นำไข่ต้ม มาบี้ผสมกับข้าวสวย ใส่น้ำปลาหรือซีอิ๊วขาวเล็กน้อยคลุกให้เข้ากัน\n- ผสมพริก น้ำปลา หอมแขก มะนาวคนให้เข้ากัน ทานกับข้าวคลุกไข่",
    userList: "",
  },
  {
    id: "2969",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "หมูหวาน",
    description: "เมนูทำง่ายสไตล์เด็กหอ",
    picture_url: "https://img-global.cpcdn.com/recipes/45bc6182afac8a42/1360x964cq70/%E0%B8%A3%E0%B8%9B-%E0%B8%AB%E0%B8%A5%E0%B8%81-%E0%B8%82%E0%B8%AD%E0%B8%87-%E0%B8%AA%E0%B8%95%E0%B8%A3-%E0%B8%AB%E0%B8%A1%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-by%E0%B8%A3%E0%B8%96%E0%B9%80%E0%B8%A1%E0%B8%A5%E0%B9%80%E0%B8%94%E0%B8%81%E0%B8%AB%E0%B8%AD.webp",
    tag: JSON.parse('["เมนูหมู","ทำง่าย","เด็กหอ"]'),
    source: "Cookpad",
    ingredient: JSON.parse('["หมู","น้ำมันพืช","กระเทียม","น้ำตาลทราย","เกลือ","ซีอิ๊วดำ","ผงปรุงรส"]'),
    step: "- ตั้งหม้อสุกี้?ให้?ร้อน? ใส่น้ำมัน?พืช? ตาม?ด้วยกระเทียม? ผัดจนเหลืองอ่อน\n-ใส่หมูลงไป? ผัดจนสุก? ปรุงรสด้วยซอสหอยนางรม? เกลือ? น้ำตาลทราย? ผงปรุงรส ซีอิ๋วดำผัดให้เข้ากัน",
    userList: "",
  },
  {
    id: "2968",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ไข่เจียวหมูสับ",
    description: "อร่อยง่าย ใครๆก็ทำได้",
    picture_url: "https://cdn1.th.orstatic.com/userphoto/Recipe/0/12/0007ID323387D0B6701222l.jpg",
    tag: JSON.parse('["ทำง่าย","ไข่ไก่"]'),
    source: "openrice",
    ingredient: JSON.parse('["ไข่ไก่","หมูสับ","น้ำมันหอย","ซีอิ๊วขาว","น้ำตาลทราย","พริกไทย","ผักชี","น้ำมันพืช"]'),
    step: "- นำไข่ไก่ตอกลงในชามผสม จากนั้นนำหมูสับใส่ลงไป ตามด้วยเครื่องปรุง น้ำมันหอย ซีอิ้วขาว น้ำตาล ลงไป จากนั้นใช้ส้อมตีให้ไข่เข้ากัน\n- นำกระทะใส่น้ำมันลงไปจากนั้นพอเริ่มร้อนใส่ไข่เจียวหมูสับลงไป รอให้ไข่ด้านล่างสุกดี จากนั้นใช้ตะหลิวกลับอีกด้านหนึ่งขึ้นมารอให้สุกดีเช่นกัน\n- พอสุกดีตักใส่จานโรยพริกไทยเล็กน้อย ตกแต่งหน้าด้วยผักชีให้สวยงาม",
    userList: "",
  },
  {
    id: "2966",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ยำวุ้นเส้น",
    description: "เมนูแซ่บๆ ที่ทำกินเองได้ง่ายๆ",
    picture_url: "https://image.bestreview.asia/wp-content/uploads/2021/02/Vermicelli-Salad.jpg",
    tag: JSON.parse('["ยำ","ทำง่าย"]'),
    source: "bestreview.asia",
    ingredient: JSON.parse('["วุ้นเส้น","เนื้อสัตว์หรือไส้กรอก","มะเขือเทศ","พริกขี้หนู","หอมแดง","ขึ้นฉ่าย","ต้นหอม","มะนาว","น้ำปลา","น้ำตาล"]'),
    step: "ลวกวัตถุดิบทั้งหมดให้สุกก่อน ไม่ว่าจะเป็นวุ้นเส้น, ไส้กรอก หรือเนื้อสัตว์ จากนั้นก็เตรียมน้ำยำด้วยการผสมพริกซอย, น้ำตาล, น้ำปลา และน้ำมะนาวเข้าด้วยกันก่อน ค่อย ๆ ชิม ค่อย ๆ ปรุงไปทีละนิดจนได้รสชาติที่ชอบ สำหรับน้ำยำเราจะปรุงให้รสเข้มไว้ก่อน ได้น้ำยำมาแล้วก็จะการนำเครื่องลวกลงคลุกก่อนเลย จากนั้นตามด้วยมะเขือเทศหั่น, หอมแดงซอย, ขึ้นฉ่ายและต้นหอมซอยปิดท้าย",
    userList: "",
  },
  {
    id: "2967",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ยำปลากระป๋อง",
    description: "เมนููทำง่าย อร่อยได้แม้ปลายเดือน",
    picture_url: "https://www.sgethai.com/wp-content/uploads/2022/04/10-4-1200x670.jpg",
    tag: JSON.parse('["ยำ","ทำง่าย","เด็กหอ"]'),
    source: "sgethai",
    ingredient: JSON.parse('["ปลากระป๋อง","ตะไคร้","หอมแดง","ใบมะกรูด","พริกขี้หนู","พริกป่น","มะนาว","น้ำปลา","น้ำตาล","ผักชี"]'),
    step: "- เทปลากระป๋องออกมา จากนั้นให้แยกเนื้อปลาออกมาใส่จานเตรียมไว้\n- ปรุงรสน้ำปลากระป๋อง โดยใส่น้ำมะนาว น้ำปลา น้ำตาล พริกป่น คนให้เข้ากัน\n- หั่นตะไคร้ หอมแดง ใบมะกรูด พริกขี้หนู เตรียมไว้ จากนั้นใส่ลงไปในน้ำยำ\n- เทน้ำยำลงไปบนเนื้อปลากระป๋อง โรยหน้าด้วยผักชี ตามชอบ",
    userList: "",
  },
  {
    id: "2979",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "หมูสับต้มแซ่บ ",
    description: "เมนูเด็กหอ",
    picture_url: "https://pbs.twimg.com/media/ErSdy4mVEAIS7im?format=jpg&name=medium",
    tag: JSON.parse('["ต้มแซ่บ","เด็กหอ"]'),
    source: "CookClick",
    ingredient: JSON.parse('["หมูสับ","พริกป่น","มะนาว","น้ำปลา","น้ำตาล","ผักชี"]'),
    step: "ต้มน้ำให้เดือด \nปรุงรสด้วย พริกป่น2ช้อน มะนาว2ลูก \nน้ำปลา 3ช้อน น้ำตาลเล็กน้อย ใส่ผักโรย",
    userList: "",
  },
  {
    id: "2977",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวผัดปลาช่อน",
    description: "เมนูเด็กหอ",
    picture_url: "https://pbs.twimg.com/media/E1q_ZsMUUAgW67Q?format=jpg&name=large",
    tag: JSON.parse('["ข้าวผัด","เด็กหอ"]'),
    source: "CookClick",
    ingredient: JSON.parse('["ปลาช่อน","ข้าว","หอมแดง","เกลือ","น้ำปลา","พริก","กระเทียมเจียว"]'),
    step: "-นำปลาช่อนไปทอดให้กรอบ\n-ตั้งกระทะ ใส่หอมแดงลงผัดให้หอม ตามด้วยข้าว \nใช้ไปแรงผัด ใส่ปลาช่องลงไป \nปรุงรสด้วยเกลือ 1 ช้อนชา น้ำปลาเล็กน้อย \nใส่กระเทียมเจียว พริก ผัดให้เข้ากัน",
    userList: "",
  },
  {
    id: "2976",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ไข่ข้นปูอัด",
    description: "เมนูเด็กหอ",
    picture_url: "https://pbs.twimg.com/media/FmSJNCeaYAEYcX1?format=jpg&name=large",
    tag: JSON.parse('["เมนูไข่","เด็กหอ"]'),
    source: "nailongdosi",
    ingredient: JSON.parse('["ไข่","ปูอัด","เกลือ","ซีอิ๊วขาว","นมจืด"]'),
    step: "-ตอกไข่ใส่ถ้วยผสมกับนมจืด\n-ปรุงรสด้วยเกลือและซีอิ๊วขาว\n-ตั้งกระทะใส่น้ำมันให้ร้อน\n-เทไข่ให้ไข่เริ่มจับตัวแล้วใส่ปูอัด\n-คนเบาๆ",
    userList: "",
  },
  {
    id: "2975",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ปลากระป๋องผัดไข่",
    description: "เมนูเด็กหอ",
    picture_url: "https://pbs.twimg.com/media/FqJYZDTaEAE26qv?format=jpg&name=large",
    tag: JSON.parse('["ปลากระป๋อง"]'),
    source: "nailongdosi",
    ingredient: JSON.parse('["ไข่","ปลากระป๋อง","หอมแดง","พริก"]'),
    step: "-ตั้งกระทะให้ร้อน\n-ตอกไข่ใส่กระทะและตีให้ไข่แดงแตก\n-รอจนกระทั่งไข่เริ่้มจับตัว\n-ใส่ปลากระป๋อง\n-ใส่พริกและหอมแดงแล้วผัดให้เข้ากัน",
    userList: "",
  },
  {
    id: "2974",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ไข่ตุ๋นไมโครเวฟ",
    description: "เมนูไข่ทำง่าย ๆ ด้วยไมโครเวฟ",
    picture_url: "https://www.sgethai.com/wp-content/uploads/2022/04/3-20.jpg",
    tag: JSON.parse('["ไข่ไก่","ทำง่าย","ไมโครเวฟ"]'),
    source: "sgethai",
    ingredient: JSON.parse('["ไข่ไก่","แฮมโบโลน่า","หมูสับ","ซีอิ๊วขาว","น้ำเปล่า"]'),
    step: "ตอกไข่ไก่ ลงในชามผสม ตีให้เข้ากัน\nใส่หมูสับ แฮมโบโลน่าลงไป ตีให้เข้ากัน\nเติมน้ำเปล่า แล้วปรุงรสด้วยซีอิ๊วขาว คนให้เข้ากัน\nเทใส่ชาม นำเข้าไมโครเวฟ ใช้ไฟแรง เป็นเวลา 4  5 นาที",
    userList: "",
  },
  {
    id: "2973",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "แซนด์วิชทูน่า",
    description: "เมนูอาหารเช้าทำง่ายๆ",
    picture_url: "https://www.sgethai.com/wp-content/uploads/2022/04/2-20.jpg",
    tag: JSON.parse('["อาหารเช้า","ทำง่าย"]'),
    source: "sgethai",
    ingredient: JSON.parse('["ขนมปังแผ่น","ทูน่ากระป๋อง","แครอท","ผักกาดหอม","มายองเนส","เกลือ"]'),
    step: "นำหอมใหญ่ แครอทมาสับให้ละเอียด จากนั้น หั่นผักกาดหอมให้เป็นชิ้นเล็ก ๆ\nเตรียมชามผสม นำทูน่ากระป๋องมาเทน้ำมันออกให้หมด จากนั้น ใส่ลงไป ตามด้วยซอสมายองเนส เกลือ 1 ช้อนชา\nใส่หอมใหญ่ แครอท และผักกาดหอมลงไป คนผสมให้เข้ากันดี จนกว่าจะได้เนื้อสัมผัสที่เหนียว ข้นติดกัน\nตักไส้ทูน่า ทาลงบนขนมปังทีละแผ่น แล้วนำมาซ้อนกัน เป็นอันเสร็จ",
    userList: "",
  },
  {
    id: "2972",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "กุ้งอบวุ้นเส้นหม้อหุงข้าว",
    description: "เมนูเส้น ทำง่ายๆ สไตล์เด็กหอ",
    picture_url: "https://img.wongnai.com/p/800x0/2018/09/06/8ebaec4af1aa46ceaec3580222ca75d2.jpg",
    tag: JSON.parse('["เมนูเส้น","ทำง่าย","เด็กหอ"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["กุ้งขาว","วุ้นเส้น","ขิงแก่","เบคอน","ผงปรุงรส","น้ำเปล่า","ซีอิ๊วขาว","ซอสหอยนางรม","ซีอิ๊วดำ","น้ำตาลทราย","น้ำมันงา","พริกไทยดำ"]'),
    step: "-ใส่ผงปรุงรส ซีอิ๊วขาว ซอสหอยนางรม ซีอิ๊วดำ น้ำตาลทราย และน้ำมันงา ลงในหม้อหุงข้าว แล้วเทน้ำตามลงไป ปิดหม้อซักครู่ให้น้ำเดือดจนทุกอย่างละลายเข้ากัน                      -ใส่เบคอนลงไปรองก้นหม้อ ตามด้วยขิง วุ้นเส้น กุ้ง ปิดฝาหม้อหุงข้าว กดปุ่มหุง แล้วรอจนสุก ",
    userList: "",
  },
  {
    id: "2984",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ปอเปี๊ยะแฮมชีส",
    description: "ว่างทำง่าย วัตถุดิบน้อย กินเพลินทั้งครอบครัว",
    picture_url: "https://www.pholfoodmafia.com/wp-content/uploads/2021/04/3Ham-and-Cheese-Spring-Roll.jpg",
    tag: JSON.parse('["ของว่าง","ปอเปี๊ยะ"]'),
    source: "Food TrueID",
    ingredient: JSON.parse('["แผ่นปอเปี้ยะ","แฮม","ชีส","แป้งผสมน้ำหรือไข่สำหรับติดแป้ง"]'),
    step: "1.ใช้แป้งปอเปี๊ยะแช่แข็งหรือแป้งสดก็ได้ \n2.นำแฮมวางตรงเกือบกลาง ตามด้วยชีส (แนะนำให้เป็นแบบแช่แข็ง) \n3.จากนั้นม้วนตัวแฮมกับชีสก่อนจากด้านมุม \n4.จากนั้นแป้งม้วนอีกที จนถึงครึ่งแผ่น พับจากด้านข้างทั้งสองฝั่งเข้ามา\n5.กดให้แน่น แล้วม้วนต่อ จากนั้นนำแป้งที่ละลายน้ำมาทาตรงส่วนที่จะปิด\n6.ตั้งกระทะ ใส่น้ำมันให้ท่วม ตั้งไฟกลางรอจนน้ำมันร้อน นำปอเปี๊ยะลงไปทอด \n7.ใช้เวลาไม่นาน กลับไปกลับมาให้ปอเปี๊ยะมีลักษณะเหลืองกรอบทั้งสองด้าน \n8.ยกขึ้นมาพักสะเด็ดน้ำมัน หั่นเป็นชิ้นตามชอบ เป็นอันเสร็จ",
    userList: "",
  },
  {
    id: "2983",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "หมูนึ่งมะนาว",
    description: "เมนูคู่ใจสายกับแกล้ม ทำง่าย",
    picture_url: "https://my.thaibuffer.com/rq/1200/630/45/imagescontent/fb_img/826/s_123457_1625.jpg",
    tag: JSON.parse('["เมนูหมู","เมนูอาหารไทย"]'),
    source: "Food TrueID",
    ingredient: JSON.parse('["สะโพกหมู","แป้งมัน","เบกกิ้งโซดา","น้ำกระเทียมดอง","น้ำตาลทราย","น้ำปลา","พริกสด","น้ำมะนาว","กระเทียมจีน","ต้นคะน้า","เกลือ","น้ำซุป"]'),
    step: "1.เตรียมหมักหมู ใส่หมู ใส่เบกกิ้งโซดา แป้งมัน น้ำสะอาด นวด ขยำจนเข้ากันดี หมักหมูไว้ประมาณ 30 นาที หรือถ้ามีเวลาให้หมัก 1 ชั่วโมง 1 คืน ก็ได้ ใส่กล่องปิดฝาแช่ตู้เย็นไว้\n2.การทำน้ำยำ เตรียมเครื่องบดสับ ใส่พริกกระเทียมลงไป ปั่นพอหยาบๆ ใส่น้ำตาลทราย น้ำกระเทียมดอง น้ำซุป น้ำปลา น้ำมะนาว ปั่นผสมพอเข้ากัน ชิมรสปรุงให้ได้ตามชอบ ให้ออก เผ็ด เปรี้ยว เค็ม หวาน หรือตามชอบ\n3.เตรียมหมูที่หมักไว้แล้ว นำไปล้างน้ำ ล้างแป้งออกให้หมด จนได้แต่เนื้อหมู\n4.ต้มน้ำให้เดือด ใส่เกลือลงไปเล็กน้อย ใส่คะน้าลงไปลวกแป้ปเดียว ตักออกแช่น้ำเย็นจัดๆ จะได้คะน้าที่กรอบอร่อยค่ะ\n5.ต้มน้ำต่อให้เดือด ใส่หมูหมักลงลวกให้พอสุก ตักพักไว้\n6.เตรียมจาน ใส่ผักคะน้าวางลงไปรองจานก่อน ตักหมูที่ลวกไว้ร้อนๆ เรียงวางลงจานคะน้า ราดด้วยน้ำยำรสรสด พอทั่วๆ หรือเยอะๆ ได้ตามชอบค่ะ ตกแต่งด้วยมะนาวฝาน กระเทียมจีนซอย เป็นอันเสร็จเรียบร้อยค่ะ",
    userList: "",
  },
  {
    id: "2982",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ต้มซุปเปอร์ไก่ ต้มแซ่บไก่",
    description: "เมนูอาหารรสจัดจ้าน น้ำซุปหอมเครื่องพะโล้และต้มยำ ได้รสเผ็ด และเปรี้ยวจากพริกขี้หนูสวนและมะนาว",
    picture_url: "https://i.ytimg.com/vi/c8XWwuhXYwE/maxresdefault.jpg",
    tag: JSON.parse('["เมนูไก่","อาหารเย็น","อาหารไทย"]'),
    source: "Food TrueID",
    ingredient: JSON.parse('["ตีนไก่","ข้อไก่","ปีกไก่","รสดีเมนูพะโล้","รสดีเมนูต้มยำ","น้ำ","ผักชีฝรั่ง","พริกขี้หนูสวน","มะนาว"]'),
    step: "1.ใส่น้ำเปล่าลงไปในหม้อ เปิดเตา ตั้งให้น้ำเดือด ใส่ผงปรุงรสพะโล้ลงไป คนผสมให้เข้ากันดี \n2.ใส่ไก่ที่ล้างทำความสะอาดเรียบร้อยลงไป ปิดฝา ใช้ไฟกลางค่อนไปแรง \n3.พอน้ำเดือดได้ที่ ช้อนเอาฟองออก ปิดฝาแบบเผยอๆ ไว้ ตุ๋นด้วยไฟอ่อนประมาณ 30-40 นาที\n4.จากนั้นใส่ผงปรุงรสต้มยำลงไป คนผสมให้เข้ากันดี ตุ๋นต่อไปอีก 5-10 นาที\n5.เตรียมเครื่องต้มยำโดยหั่น มะนาว ผักชีฝรั่ง และนำพริกขี้หนูสวนมาบุบให้พอแตก \n6.ปิดเตา ใส่พริกขี้หนูสวนลงไป ตามด้วยผักชีฝรั่ง และน้ำมะนาว เป็นอันเสร็จ",
    userList: "",
  },
  {
    id: "2991",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "หมูตุ๋นแบบบ้านๆ",
    description: "เมนูตุ๋นนุ่มลิ้น ละลายในปาก",
    picture_url: "https://img.wongnai.com/p/1968x0/2018/05/07/44e6d612190d4b24bf350501d5e097aa.jpg",
    tag: JSON.parse('["ตุ๋น","นุ่ม","หมู"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["หมู","เครื่องตุ๋นยาจีน","รากขึ้นฉ่าย","ซุปก้อน"]'),
    step: "1.ต้มน้ำและใส่ซุปก้อน ขึ้นฉ่ายและเครื่องตุ๋นยาจีนลงไป 2.พอน้ำเดือดก็ใส่หมูที่หั่นเป็นชิ้นลงไป 3.ตุ๋นเนื้อให้นุ่มจนพอใจ ระหว่างนี้ถ้าน้ำหมดฏ้ให้เติมน้ำลงไปและคอยตักฟองออก",
    userList: "",
  },
  {
    id: "2989",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "สุกี้แห้ง",
    description: "เมนูทำง่าย สุขภาพดี",
    picture_url: "https://img.wongnai.com/p/1968x0/2018/08/06/c512bd4d3df34048835d4d74decef5ec.jpg",
    tag: JSON.parse('["ทำง่าย","ผัก","สุขภาพดี"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["เนื้อสัตว์","ผักตามใจชอบ","วุ้นเส้น","ไข่"]'),
    step: "1.ต้มน้ำและใส่เนื้อสัตว์ลงไป 2.ใส่ผักตามใจชอบ หรือาจจะใส่วุ้นเส้นและไข่ด้วยด้วย 3.เทน้ำออกพร้อมทานเติมน้ำจิ้มได้ตามต้องการ",
    userList: "",
  },
  {
    id: "2985",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ปีกไก่นิวออร์ลีนส์",
    description: "เมนูจากไก่ที่หลายๆคนชื่นชอบ ทำง่ายอร่อยด้วย",
    picture_url: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSoMBtNwYnhRgqqxvYl7Nu3on6wq0JkCWl7KQ&usqp=CAU",
    tag: JSON.parse('["ทำง่าย","อร่อย","ไก่"]'),
    source: "Wongnai ",
    ingredient: JSON.parse('["ปีกไก่กลาง","เนย","ซอสมะเขือเทศ","ซอสพริกศรีราชา","พริกไทยดำ","ซอสปรุงรส","ซีอิ้วขาว","น้ำมันหอย","ผงปาปริกา","พริกป่น"]'),
    step: "1.ใช้ส้อมจิ้มปีกไก่ให้ทั่วเพื่อให้เครื่องหมักซึมเข้าถึงเนื้อใน 2.คลุกเคล้าเครื่องปรุงทั้งหมดให้เข้ากันและเเช่เย็นไว้ 30 นาที 3.อบ 15 นาทีที่ 180 องศา จากนั้นกลับด้านไก่และทาซอสเพิ่มและอบต่ออีก 15 นาที",
    userList: "",
  },
  {
    id: "2988",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ไข่ข้นกุ้ง",
    description: "ทำง่ายอร่อยเวอร์",
    picture_url: "https://img.wongnai.com/p/1968x0/2017/09/26/f4a2b35abd654da6897ac35a7828866e.jpg",
    tag: JSON.parse('["ทำง่าย","ไข่","กุ้ง"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["กุ้งขาว","ไข่","ซอสปรุงรส","ข้าวสวย"]'),
    step: "1.ทำการเตรียมกุ้งให้เรียบร้อย 2.สับกุ้งขนาดตามชอบ 3.ทำการตีไข่และใส่ซอสปรุงรสตามชอบ 4.ทำการเจียวไข่และเทกุ้งลงไปและขนให้เกิดไข่ข้น 5.เทไข่ข้นลงบนข้าวสวยพร้อมทาน",
    userList: "",
  },
  {
    id: "2986",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ไก่ต้มน้ำปลา",
    description: "ทำง่าย กินกับข้าวก็อร่อย",
    picture_url: "https://img.wongnai.com/p/1920x0/2017/09/18/c6e6b8a7c117420cbaf65eda2c094a71.jpg",
    tag: JSON.parse('["ทำง่าย","อร่อย","ไก่"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["น่องไก่ติดสะโพก","รากผักชี","น้ำปลา","น้ำเปล่า","ซีอิ๊วดำ","น้ำตาลทราย","กระเทียม","ซอสหอยนางรม"]'),
    step: "1.ใส่น้ำลงไปในหม้อจากนั้นใส่กระเทียม รากผักชี ซอสหอยนางรม ซีอิ๊วดำ น้ำปลา และน้ำตาลทราย คนให้เข้ากันจนน้ำตาลทรายละลายหมด 2.พอน้ำเดือดก็นำไก่ลงไปต้มจนสุกและสีสวย พร้อมทาน",
    userList: "",
  },
  {
    id: "2992",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ผัดผักรวมน้ำมันหอย",
    description: "เมนูรวมผักเหลือทำง่าย",
    picture_url: "https://img.wongnai.com/p/1968x0/2017/12/03/e20a57b22a364f52955eacbdd7cb72d6.jpg",
    tag: JSON.parse('["ผัก","สุขภาพดี","ทำง่าย"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["บล็อคโคลี","แครอท","มะเขือเทศ","กะหล่ำปลี","ซอสปรุงรส","น้ำมันหอย","น้ำเปล่า"]'),
    step: "1.ตั้งกระทะใส่น้ำมันเล็กน้อย และเทผักลงไป 2.ใส่ซอสปรุงรสเเละน้ำมันหอย ปรุงรสตามใจชอบ 3.พอผักสุกเทน้ำเปล่าลงเล็กน้อย พร้อมทาน",
    userList: "",
  },
  {
    id: "2987",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "กุ้งแช่น้ำปลา",
    description: "เมนูเด็ด ซี๊ดซะใจ",
    picture_url: "https://img.wongnai.com/p/1920x0/2018/08/20/ede072d63c1e43a7bf92dde24f7d80bf.jpg",
    tag: JSON.parse('["ทำง่าย","เผ็ด","เปรี้ยว"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["กุ้งขาว","น้ำปลาแท้","น้ำมะนาว","โซดา","น้ำตาลทราย","กระเทียม","พริกขี้หนู","รากผักชี","กะหล่ำปลีซอย","มะระฝาน","ใบสะระแหน่","น้ำเปล่า"]'),
    step: "1.ล้างกุ้งให้สะอาดนำเส้นหลังกุ้งออกแล้วแช่โซดา 2.ทำน้ำราดกุ้งโดยผสมน้ำปลา น้ำเปล่า น้ำตาลทรายและใส่พริกกระเทียมซอย 3.ราดน้ำราดเตรียมเสริฟ",
    userList: "",
  },
  {
    id: "2947",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวผัดไข่",
    description: "ข้าวผัดไข่ ทำง่าย ทานง่าย อร่อยได้ทันที ไม่ว่าใครก็สามารถทำได้ง่าย ๆ ",
    picture_url: "https://food.mthai.com/app/uploads/2017/02/fried-rice.jpg",
    tag: JSON.parse('["อาหารเช้า","ทำง่าย","ไข่ไก่"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["หัวหอม","พริกไทย","ไข่ไก่","ข้าวสวย","น้ำมันพืช","เกลือ"]'),
    step: "*ก่อนจะทำข้าวผัดไข่นำข้าวไปผึ่งลมก่อนนำมาผัด หรือเป็นข้าวสวยแช่เย็นเพื่อให้ข้าวเป็นเม็ดสวยไม่เฉะ\n*รีบผัดข้าวอย่างเร็วเมื่อใส่ไข่ลงไป ให้ไข่เครือบข้าว\nวิธีทำ \n1. เทน้ำมันลงในกระทะ วนให้น้ำมันทั่วกระทะแล้วเทน้ำมันออก นำข้าวสวยมาผัดให้ข้าวร้อน และร่วน \n2. ตอกไข่ลงแล้วผัดให้ไข่เคลือบเม็ดข้าวให้ทั่ว \n3. ปรุงรสด้วยเกลือ และพริกไทย ใส่ต้นหอมซอย\n4. เพิ่มส่วนประกอบตามชอบได้เลย",
    userList: "",
  },
  {
    id: "2950",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "มินิพิซซ่า ไมโครเวฟ",
    description: "อาหารทานเล่นสำหรับวันสบายๆ ฉบับทำได้ในครัวเรือน มินิพิซซ่า แค่มีหม้ออบลมร้อนหรือเตาไมโครเวฟก็ทำได้แล้ว วัตถุดิบหาซื้อง่ายตาม Supermarket อยากท็อปหน้าอะไรเพิ่มก็ได้ตามชอบ ใช้เวลาทำไม่ถึง 10 นาที",
    picture_url: "https://www.kinraideewa.com/wp-content/uploads/2021/09/Italian-food.jpg",
    tag: JSON.parse('["ไมโครเวฟ","ทำง่าย"]'),
    source: "kinraideewa",
    ingredient: JSON.parse('["ขนมปังแผ่น","ซอสมะเขือเทศ","มายองเนส","ชีสมอสซาเรลล่า","ไส้กรอก","ปูอัด","สับปะรด","ออริกาโน่","ใบพาสลีย์"]'),
    step: "*ใช้ไมโครเวฟ หรือหม้ออบลมร้อน\nวิธีทำ\n1. ทาซอสมะเขือเทศให้ทั่วแผ่นขนมปัง โรยชีสให้ทั่ว ใส่ไส้กรอก+ปูอัด ตามด้วยพริกพยวก+สัปปะรด ทาทับด้วยมายองเนส ปิดท้ายด้วยโรยชีสอีกรอบ เน้นชีสยืด\n2. นำเข้าหม้ออบ ใช้ไฟ 160 องศา ตั้งเวลา 5-6 นาที อบเสร็จนำออกมา โรยด้วยออริกาโน่และใบพาสลีย์ เสร็จพร้อมทานทันที",
    userList: "",
  },
  {
    id: "2951",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "น้ำตกคอหมูย่าง",
    description: "เมนูอาหารอีสานยอดฮิต ทุกร้านส้มตำต้องมีขาย น้ำตกคอหมูย่าง ให้ฟินต้องกินกับข้าวเหนียวร้อนๆ ทำได้ไม่ยาก",
    picture_url: "https://www.kinraideewa.com/wp-content/uploads/2021/09/ready-to-serve.jpg",
    tag: JSON.parse('["อาหารอีสาน"]'),
    source: "kinraideewa",
    ingredient: JSON.parse('["คอหมู","ข้าวคั่ว","พริกป่น","น้ำปลา","น้ำตาล","น้ำมะขาม","มะนาว","ต้นหอม","หอมแดง","ใบสะระแหน่"]'),
    step: "*ทำการย่างคอหมูให้เสร็จเรียบร้อย หรืออาจซื้อคอหมูย่างสำเร็จมาเลยก็ได้\nวิธีทำ\n1. นำคอหมูที่ย่างแล้วมาหั่นเป็นชิ้นบาง\n2. ปรุงน้ำตกด้วยพริกป่น, มะนาว, น้ำมะขาม, น้ำปลา, น้ำตาล, และข้าวคั่ว คนให้เข้ากัน\n3. เอาคอหมูย่างไปคลุกเคล้าให้เข้ากัน\n4. ปรุงรสตามชอบ จากนั้นใส่หอมแดงกับต้นหอม ปิดท้ายท็อปด้วยใบสะระแหน่ พร้อมทานได้เลย",
    userList: "",
  },
  {
    id: "2993",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "กะหล่ำปลีทอดน้ำปลา",
    description: "ทำง่าย ใช้ของน้อย แต่อร่อยมาก",
    picture_url: "https://img.wongnai.com/p/1968x0/2019/03/19/8a5e734a233f4c65ae819a65d9e9ec4a.jpg",
    tag: JSON.parse('["ผัก","ทำง่าย"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["กะหล่ำปลี","น้ำปลา","น้ำตาลทราย","กระเทียม"]'),
    step: "1.แกะกะหล่ำปลีปลีออกเป็นแผ่นและล้างสะเด็ดน้ำ 2.ทำน้ำผัดโดยผสมน้ำปลา น้ำตาลทรายและใส่ซอสปรุงรส 3.ทุบกระเทียม ตั้งกระทะให้ร้อนและเทกระเทียมลงไป 4.พอกระเทียมเริ่มเปลี่ยนสีให้ใส่กะหล่ำปลีลงไป 5.เทน้ำซอสที่เตรียมไว้ลงไปผัด 5.ผัดจนกะหล่ำปลีเริ่มเหี่ยว และพร้อมเสริฟ",
    userList: "",
  },
  {
    id: "2952",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ไข่ตุ๋นมาม่า",
    description: "เมนูไข่ตุ๋นแปลกใหม่ ทำง่ายแสนง่ายด้วยเตาไมโครเวฟ",
    picture_url: "https://i.ytimg.com/vi/bbOuWjxQDQM/maxresdefault.jpg",
    tag: JSON.parse('["ไข่ไก่","ทำง่าย"]'),
    source: "scgthai",
    ingredient: JSON.parse('["ไข่ไก่","มาม่า","แครอท","แฮม","ต้นหอม","น้ำเปล่า","ผงปรุงรส","ซอสปรุงรส"]'),
    step: "* หั่นแครอทเป็นเต๋า และซอยต้นหอมเตรียมไว้\n1. ตอกไข่ไก่ ใส่ภาชนะที่จะจัดเสิร์ฟ แล้วตีให้เข้ากัน จากนั้น เติมน้ำเปล่าลงไป 1 ฟองต่อ 200 มล.\n2. นำแฮมมาหั่นชิ้นเล็ก ๆ ใส่ลงไป ตามด้วยแครอทหั่นเต๋า และต้นหอมซอยเล็กน้อย\n3. ปรุงรสด้วย ผงปรุงรส และซอสปรุงรสฝาเขียว\n4. ลวกเส้นมาม่าให้สุก จากนั้น นำใส่ลงไป คลุกเคล้าให้เข้ากัน\n5. นำไปอุ่นในเตาไมโครเวฟ ใช้เวลา 15 นาที พอครบเวลา นำออกมา โรยด้วยต้นหอมซอยเล็กน้อย เป็นอันเสร็จปรุงผงมาม่าด้วยก็ได้ตามชอบ",
    userList: "",
  },
  {
    id: "2963",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวผัดอเมริกัน",
    description: "อาหารมื้อเช้าสไตล์อเมริกันที่มีสารอาหารให้ครบทั้ง 5 หมู่ ปรุงรสให้อร่อย เติมผักเพิ่มสีสัน",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/nc25emz04wfu9gqynauyfsu6hsrd7vqcusvp4hob.png",
    tag: JSON.parse('["เมนูผัด","มื้อเช้า","ไข่"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["ไส้กรอก","ข้าวสวย","ไข่ไก่","น่องไก่เล็ก","มะเขือเทศ","ซอสมะเขือเทศ","ซีอิ๊วขาว","น้ำตาลทราย","ซอสปรุงรส","กระเทียม","ลูกเกด","ถั่วลันเตา","ข้าวโพด"]'),
    step: "ทอดไข่ดาว น่องไก่เตรียมไว้ และผ่าไส้กรอกคอกเทลหัวท้าย แล้วนำไปทอด นำขึ้นมาสะเด็ดน้ำมัน ตั้งกระทะเตรียมผัด เทน้ำมันรอให้กระทะร้อน ใส่กระเทียมสับลงไปผัดจนเหลือง ตามด้วยข้าวสวยที่เตรียมไว้ ใส่มะเขือเทศ ถั่วลันเตา ข้าวโพด และผัดให้เข้ากัน ปรุงรสด้วยซอสมะเขือเทศ ซีอิ๊วขาว น้ำตาลทราย และซอสปรุงรส ผัดเข้ากันและโรยลูกเกดเข้าไปผัดด้วย ปิดเตา ตักใส่จาน และตกแต่งด้วยไข่ดาว และไส้กรอกคอกเทล",
    userList: "",
  },
  {
    id: "2959",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ผัดมาม่าเกาหลีโบโลน่าพริก",
    description: "เมนูที่อร่อยได้ทุกมื้อวัตถุดิบที่สามารถหาซื้อได้ง่าย ทำง่าย อร่อยได้ภายไม่กี่นาที",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/nwyorppesk4euljsiirsk0ilynck8ngawitwpgsl.png",
    tag: JSON.parse('["เมนูผัด","มาม่าเกาหลี","โบโลน่าพริก"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["โบโลน่า","มาม่าเผ็ดเกาหลี","ไข่ไก่","ต้นหอมซอย","งาขาว","สาหร่าย","ผักกาดหอม"]'),
    step: "ลวกเส้นบะหมี่กึ่งสำเร็จรูปให้สุกนิ่ม ตั้งกระทะทอดไข่ดาว ตั้งกระทะอีกครั้งเพื่อผัดโบโลน่าและเส้น ปรุงรสชาติของเส้นด้วยซอสที่ให้มากับมาม่าเกาหลี แต่งจานโดยเอาไข่ดาวมาโปะข้างบน โรยด้วยเครื่องปรุงที่ให้มากับตัวซอง แต่งเพิ่มด้วยผักกาดขาว ต้นหอมซอย สาหร่ายและงาขาว",
    userList: "",
  },
  {
    id: "2954",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "แกงเขียวหวานไก่",
    description: "อาหารไทยประเภทแกง นิยมรับประทานกับข้าวสวยหรือขนมจีนน้ำพริกแกงมีสีเขียว",
    picture_url: "https://www.ajinomoto.co.th/storage/photos/shares/Recipe/Menu/3-19Greencurry/61a8f3939f40f.jpeg",
    tag: JSON.parse('["เมนูแกง","อาหารไทย","อาหารไทยภาคกลาง"]'),
    source: "CPBrandsite, Ajinomoto",
    ingredient: JSON.parse('["พริกชี้ฟ้า","พริกขี้หนูสวน","กระเทียม","หอมแดง","ข่า","ตะไคร้","รากผักชี","มะกรูด","ขมิ้น","พริกไทยขาวเม็ด","ลูกผักชี","ยี่หร่า","เกลือ","กะปิ","เนื้อไก่","หัวกะทิ","หางกะทิ","มะเขือเปราะ","มะเขือพวง","ใบมะกรูด","โหระพา","น้ำปลา","น้ำตาลทรายแดง"]'),
    step: "ทำพริกแกงใส่พริกไทย พริกกับเกลือ ข่า ตะไคร้ ผิวมะกรูด รากผักชี หอมแดง กระเทียม กะปิ ตามลำดับโขลกให้เข้ากัน การทำแกงตั้งไฟหัวกะทิ เคี่ยวให้มันแตก ใส่เนื้อไก่ลงไปผัด ใส่ใบมะกรูดฉีก ผัดให้ไก่สุก เติมหางกะทิกลาง ปรุงรสด้วยน้ำปลา น้ำตาลทรายแดง ใส่มะเขือเปราะ และมะเขือพวง ใส่พริกชี้ฟ้าแดง ใบโหระพา",
    userList: "",
  },
  {
    id: "2980",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "หมูแดดเดียว",
    description: "เมนูทำง่าย กินคู่กับข้าวเหนียวร้อนๆ",
    picture_url: "https://i.ytimg.com/vi/IZf1LEu1Hoo/maxresdefault.jpg",
    tag: JSON.parse('["เมนูหมู","เมนูทอด"]'),
    source: "Food TrueID",
    ingredient: JSON.parse('["เนื้อหมู","กระเทียม","พริกไทย","เกลือ","น้ำตาลทราย"]'),
    step: "1.นำหมูส่วนสะโพก มาหั่นตามลายเนื้อ เป็นชิ้นยาวเท่าๆ กัน\n2.นำพริกไทยเม็ด มาโขลกพอหยาบ ตามด้วยกระเทียม โขลกพอหยาบ ตักใส่ในหมู\n3.จากนั้นตามด้วยเกลือ และน้ำตาลทราย จากนั้นคลุกเคล้าให้เข้ากัน ใช้มือในการนวดส่วนผสมกับเนื้อหมูให้เข้ากันประมาณ 5 นาที\n4.นำไปวางเรียงบนกระด้ง หรือตะแกรง จัดทรงให้เรียงสวย นำไปตากแดดให้ผิวเริ่มตึง หากแดดแรงจัด ใช้เวลาเพียง 1 ชั่วโมง จากนั้นนำมาพลิกกลับด้าน แล้วไปตากต่ออีก 1-2 ชั่วโมง\n5.ตั้งน้ำมันเต็มกระทะ เปิดไฟให้ร้อน จากนั้นนำหมูลงไปทอด ข้อควรระวังคือ หมูแดดเดียวจะสุกง่าย ต้องคอยคนเรื่อยๆ เพื่อให้ความสุกเท่ากัน\n6.เมื่อได้สีสวยงามแล้ว ตักขึ้นมาพักสะเด็ดน้ำมัน เป็นอันเสร็จ",
    userList: "",
  },
  {
    id: "2981",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "หมึกทอดน้ำปลา",
    description: "เมนูทานเล่น , เมนูทำง่าย",
    picture_url: "https://i.ytimg.com/vi/IVZ2tmFocLI/maxresdefault.jpg",
    tag: JSON.parse('["เมนูทอด","ทำง่าย"]'),
    source: "Food TrueID",
    ingredient: JSON.parse('["หมึกหอม","แป้งทอดกรอบ","น้ำปลา"]'),
    step: "1.นำหมึกหอมล้างทำความสะอาด นำฟันและตาออกให้เรียบร้อยพร้อมลอกหนัง จากนั้นนำมาหั่นเป็นชิ้นพอดีคำ ตามความชอบ \n2.จากนั้นนำหมึกมาลวกด้วยน้ำเดือดประมาณ 30 - 60 วินาที ตักขึ้นมาพักไว้\n3.เยาะน้ำปลาลงไปเล็กน้อย คลุกเคล้าให้ทั่ว พักไว้\n4.นำแป้งทอดกรอบเทใส่จานคลุก \n5.ตั้งกระทะ ใส่น้ำมัน ใช้ไฟกลาง รอให้น้ำมันร้อนจัด นำหมึกมาคลุกกับแป้งแห้งให้ทั่วกันทุกด้าน\n6.นำลงไปทอด แนะนำว่าต้องคลุกแป้งละทอดเลย ไม่ควรคลุกทิ้งไว้ ไม่อย่างนั้นแป้งจะจับตัวเป็นก้อน\n7.คนให้ปลาหมึกสุกทั่วกัน จนสีแป้งออกเหลืองทอง ตักขึ้นมาพักสะเด็ดน้ำมัน เสิร์ฟพร้อมน้ำจิ้มซีฟู้ด",
    userList: "",
  },
  {
    id: "2971",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ข้าวหน้าหมูสไลซ์ราดไข่ไมโครเวฟ",
    description: "ข้าหน้าหมูสไลซ์ง่ายๆสไตล์เด็กหอ",
    picture_url: "https://img.wongnai.com/p/800x0/2018/09/07/0c849ea80a314ec2920b854c71124206.jpg",
    tag: JSON.parse('["ไมโครเวฟ","อาหารญี่ปุ่น","ทำง่าย"]'),
    source: "Wongnai",
    ingredient: JSON.parse('["ข้าวสวย","หมูสไลด์","ผงปรุงรส","ไข่ไก่","หอมหัวใหญ่","น้ำตาลทราย","ต้นหอม","น้ำเปล่า"]'),
    step: "-นำหมูสไลซ์มาปรุงรสด้วย ผงปรุงรส น้ำตาลทราย หอมหัวใหญ่ น้ำ และ เครื่องปุงอื่นๆตามใจชอบ ผสมให้เข้ากัน แล้วนำไปใส่ไมโครเวฟความร้อน 800 วัตต์ 8 นาทีให้หมูสุก       - ตีไข่เตรียมเอาไว้ เตรียมข้าวสวยใส่ชาม แล้วนำหมูมาเรียงให้สวยงาม จากนั้นเทไข่ลงไป แล้วนำไปเข้าไมโครเวฟอุณหภูมิ 800 วัตต์ 1 นาที ให้ไข่สุกพอเยิ้มๆ จากนั้นโรยด้วยต้นหอมพร้อมเสิร์จ",
    userList: "",
  },
  {
    id: "2961",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ก๋วยเตี๋ยวลูกชิ้นน้ำใส",
    description: "สูตรลับเมนูอร่อยประจำบ้าน เมนูทำง่ายมาก ไม่ต้องง้อร้าน",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/0lkbodivfzj2izstiiw79fwhtd16j5tifzzps4mp.png",
    tag: JSON.parse('["เมนูก๋วยเตี๋ยว","ลูกชิ้นหมู","เส้นหมี่"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["ลูกชิ้นหมู","เส้นหมี่","น้ำสต็อกหมู","น้ำเปล่า","ถั่วงอก","ตั้งฉ่าย","กระเทียมเจียว","ต้นหอม","ผักชี"]'),
    step: "ทำน้ำซุปด้วยการนำน้ำสต็อกหมู ผสมกับน้ำเปล่าตั้งไฟจนเดือดจากนั้นพักไว้ ตั้งน้ำสำหรับลวกให้เดือด ลวกเส้นหมี่  ถั่วงอกและลูกชิ้นหมูก๋วยเตี๋ยว จากนั้นจัดเรียงใส่ชามที่จะเสิร์ฟแล้วพักไว้ นำน้ำซุปราดลงบนชามก๋วยเตี๋ยว ปริมาณตามความชอบ แต่งหน้าด้วย ตั้งฉ่าย กระเทียมเจียวและต้มหอมผักชีซอย",
    userList: "",
  },
  {
    id: "2962",
    created_at: "2023-03-06 07:31:23.270558+00",
    name: "ยำขนมจีน",
    description: "เมนูรสแซ่บซี๊ด เด็ดจนต้องสูดปาก รสชาติสุดนัว เติมเครื่องแน่น ๆ กินกับผักสด ๆ",
    picture_url: "https://www.cpbrandsite.com/contents/recipe/jwde0fwcqerjvi8yoxc7m8p09cjmo93opqpa4zkp.png",
    tag: JSON.parse('["เมนูยำขนมจีน","น้ำปลาร้าปรุงสำเร็จ","ขนมจีน"]'),
    source: "CPBrandsite",
    ingredient: JSON.parse('["น้ำยำปลาร้า","ขนมจีน","ปลาทูทอด","ถั่วฝักยาว","พริกขี้หนู","น้ำมะนาว","น้ำตาลปี๊บ","น้ำปลา","พริกป่น"]'),
    step: "นำน้ำยำปลาร้าปรุงสำเร็จ น้ำมะนาว น้ำตาลปี๊ป พริกป่น น้ำปลาผสมกัน คนให้น้ำตาลละลาย ใส่ส่วนผสมที่เหลือ ได้แก่ ขนมจีน ปลาทูอด พริกขี้หนูซอย ถั่วฝักยาวซอย คลุกเคล้าให้เข้ากัน",
    userList: "",
  },
]);
</script>
